<html><head>
<title>[Chapter 36] 36.7 Alphabetized Reference</TITLE>
<meta name="DC.title" content="sendmail"><meta name="DC.creator" content="Bryan Costales &amp; Eric Allman"><meta name="DC.publisher" content="O'Reilly &amp; Associates, Inc."><meta name="DC.date" content="1999-01-06T22:00:36Z"><meta name="DC.type" content="Text.Monograph"><meta name="DC.format" content="text/html" scheme="MIME"><meta name="DC.source" content="1-56592-222-0" scheme="ISBN"><meta name="DC.language" content="en-US"><meta name="generator" content="Jade 1.1/O'Reilly DocBook 3.0 to HTML 4.0"><link rev="made" href="mailto:online-books@oreilly.com" title="Online Books Comments"><link rel="up" href="ch36_01.htm" title="36. The Command Line"><link rel="prev" href="ch36_06.htm" title="36.6 Pitfalls"><link rel="next" href="ch37_01.htm" title="37. Debugging with -d"></HEAD
><body bgcolor="#FFFFFF" text="#000000"><div class="htmlnav"><h1><img src="gifs/smbanner.gif" alt="sendmail" usemap="#srchmap" border="0"></H1
><map name=index.html"srchmap"><area shape="RECT" coords="0,0,466,65" href="index.htm" alt="sendmail"><area shape="RECT" coords="467,0,514,18" href="../search/ssrch.htm" alt="Search this book"></MAP
><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="ch36_06.htm" title="36.6 Pitfalls"><img src="../gifs/txtpreva.gif" alt="Previous: 36.6 Pitfalls" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><b><font face="ARIEL,HELVETICA,HELV,SANSERIF" size="-1">Chapter 36<br>The Command Line</FONT
></B
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="CHAPTER" href="ch37_01.htm" title="37. Debugging with -d"><img src="../gifs/txtnexta.gif" alt="Next: 37. Debugging with -d" border="0"></A
></TD
></TR
></TABLE
>&nbsp;<hr align="LEFT" width="515" title="footer"></DIV
><div class="SECT1"><h2 class="sect1"><a class="title" name="SML2-CH-36-SECT-7">36.7 Alphabetized Reference</A
></H2
><p class="para">Command-line switches are those command-line arguments that precede
the list of recipients and begin with a <code class="literal">-</CODE
> character.
For a complete list of command-line
switches, see <a class="xref" href="ch36_02.htm" title="Command-Line Switches">Table 36.2</A
> in <a class="xref" href="ch36_02.htm" title="Command-Line Switches">Section 36.2, "Command-Line Switches"</A
>.</P
><p class="para">In this section we present a full description of each switch
in alphabetical order. Where two switches differ by case, the uppercase
switch precedes the lowercase switch.</P
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-1">36.7.1 -B</A
></H3
><p class="refpurpose">Specify message body type</P
>(V8.1 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-51909"></A
><a class="indexterm" name="AUTOID-51911"></A
><a class="indexterm" name="AUTOID-51915"></A
><a class="indexterm" name="AUTOID-51918"></A
>MIME (Multimedia) support in V8 <em class="emphasis">sendmail</EM
> has been coupled
to ESMTP (Extended SMTP) of the new BODY parameter for the
MAIL command. The BODY parameter is passed through as is to the
delivery agent.
Two special parameters are internally recognized by <em class="emphasis">sendmail</EM
>.
They tell <em class="emphasis">sendmail</EM
> that the message body is either <code class="literal">7bit</CODE
> or
<code class="literal">8bitmime</CODE
>. <code class="literal">7bit</CODE
> forces the high bit off. <code class="literal">8bitmime</CODE
> causes <em class="emphasis">sendmail</EM
>
to leave the high bit unchanged. Both override any setting of the
<code class="literal">SevenBitInput</CODE
> (<code class="literal">7</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.62, SevenBitInput (7)</A
>).</P
><p class="para">When <em class="emphasis">sendmail</EM
> connects to another site for incoming mail, it
has no way to determine from context whether or not it is dealing
with MIME mail. To override any configured assumptions, you may
use the <code class="literal">-B</CODE
> command-line switch.</P
><p class="para"><blockquote class="screen"><pre class="screen">-B 7BIT
-B 8BITMIME</PRE
></BLOCKQUOTE
></P
><p class="para">Case is unimportant (7BIT and 7bit both work). The <code class="literal">7bit</CODE
>
causes the local <em class="emphasis">sendmail</EM
> to tell the remote <em class="emphasis">sendmail</EM
>
(in ESMTP mode) that the message body should have the high bit
stripped from every byte. Conversely, <code class="literal">8bitmime</CODE
> tells the remote
<em class="emphasis">sendmail</EM
> to preserve the high bit of each byte.</P
><p class="para">The value given to this <code class="literal">-B</CODE
> command-line or received via the
BODY parameter is stored in the <code class="literal">${bodytype}</CODE
> macro
(see <a class="xref" href="ch31_10.htm" title="">Section 31.10.4, ${bodytype}</A
>).</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-2">36.7.2 -b</A
></H3
><p class="refpurpose">Set operating mode</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-51954"></A
><a class="indexterm" name="SML2-CH-36-IX-MODES-SENDMAIL-OPERATING"></A
>The <code class="literal">-b</CODE
> switch tells <em class="emphasis">sendmail</EM
> in
what mode to operate.
For example, <em class="emphasis">sendmail</EM
> can &quot;become&quot; a daemon listening for
incoming SMTP connections, or it can run in a mode that tells
it to simply print the contents of the queue and exit.
The form of the <code class="literal">-b</CODE
> switch is:</P
><p class="para"><blockquote class="screen"><pre class="screen">-b<code class="replaceable"><i>mode</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">If <code class="replaceable"><i>mode</I
></CODE
> is
more than a single letter, all but the first letter is silently ignored.
If the <code class="replaceable"><i>mode</I
></CODE
> is missing or not one of those allowed,
<em class="emphasis">sendmail</EM
> prints the following error message and exits:</P
><p class="para"><blockquote class="screen"><pre class="screen">Invalid operation mode <i class="lineannotation">bad letter here</I
></PRE
></BLOCKQUOTE
></P
><p class="para">If the <code class="literal">-b</CODE
> command-line switch is omitted altogether, the default
mode becomes <code class="literal">-bm</CODE
> (deliver mail and exit).</P
><p class="para">Beginning with V8.7, <em class="emphasis">sendmail</EM
> the letter that selected the operating mode
is assigned at startup to the <code class="literal">${opMode}</CODE
> macro (see <a class="xref" href="ch31_10.htm" title="">Section 31.10.28, ${opMode}</A
>).</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-3">36.7.3 -ba</A
></H3
><p class="refpurpose">Use ARPAnet/Grey Book protocols</P
>(Not V8.1 - V8.6)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-51988"></A
><a class="indexterm" name="AUTOID-51990"></A
>In the distant past, mail messages on
ARPAnet were sent by using the <em class="emphasis">ftp</EM
>(1) protocol. Because
that protocol was never intended for use with email,
many different departures were designed (&quot;patched in&quot;)
to solve particular problems. That growing
anarchy caused Jonathan B. Postel to design the
Simple Mail Transfer Protocol (SMTP) in 1982 and to document that
protocol in RFC821. Since then, SMTP has replaced
FTP as the Internet standard.</P
><p class="para">In the belief that sufficient time had passed for all sites to have adopted SMTP, the
<code class="literal">-ba</CODE
> mode was deemed obsolete and removed from the V8.1 <em class="emphasis">sendmail</EM
>.
It turned out that the British Grey Book protocol was based on FTP.
To support that protocol, this <code class="literal">-ba</CODE
> command-line switch was
restored in V8.7 <em class="emphasis">sendmail</EM
>.</P
><p class="para">The <code class="literal">-ba</CODE
> switch causes each line of a message to be terminated with a carriage-return
line-feed pair instead of with a newline. This switch also forces <em class="emphasis">sendmail</EM
>
to guess the sender from the message header, instead of parsing it from
the envelope. The <code class="literal">-ba</CODE
> switch should <em class="emphasis">never</EM
> be used
outside of a Grey Book setting.</P
><p class="para"></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-4">36.7.4 -bD</A
></H3
><p class="refpurpose">Run as a daemon, but don't fork</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52013"></A
><a class="indexterm" name="AUTOID-52016"></A
>The <code class="literal">-bD</CODE
> command line switch is almost exactly the same as
the <code class="literal">-bd</CODE
> switch. That is,
it causes <em class="emphasis">sendmail</EM
> to run as a daemon, but, unlike the <code class="literal">-bd</CODE
>
switch, it prevents <em class="emphasis">sendmail</EM
> from performing a <em class="emphasis">fork</EM
>(2) and thereby
keeps <em class="emphasis">sendmail</EM
> in the foreground.
This allows <em class="emphasis">sendmail</EM
> to be run from a &quot;wrapper&quot; script
to detect whether it died or was killed:</P
><p class="para"><blockquote class="screen"><pre class="screen">#!/bin/sh
SENDMAIL=/usr/lib/sendmail
UCBMAIL=/usr/ucb/mail

if [ -f $SENDMAIL -a -f $UCBMAIL ]
then
        $SENDMAIL -bD -q1h
        echo ${SENDMAIL}, which should run forever, died \
                | $UCBMAIL -s &quot;Sendmail died&quot; root
fi</PRE
></BLOCKQUOTE
></P
><p class="para">Note that the <code class="literal">echo</CODE
> line will never be reached as long as <em class="emphasis">sendmail</EM
>
continues to run.</P
><p class="para">Also note that <code class="literal">-bD</CODE
> also prevents detaching from the controlling terminal 
(just as does the <code class="literal">-d99.100</CODE
> debugging switch; see <a class="xref" href="ch37_05.htm" title="">Section 37.5.193, -d99.100</A
>).</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-5">36.7.5 -bd</A
></H3
><p class="refpurpose">Run as a daemon</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52043"></A
>The <code class="literal">-bd</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
>
to become a daemon, running in the background, listening
for and handling incoming SMTP connections.
[5]</P
><blockquote class="footnote"><p class="para">[5] In its classic invocation, <code class="literal">-bd</CODE
> is usually combined with
a <code class="literal">-q1h</CODE
>.</P
></BLOCKQUOTE
><p class="para">To become a daemon, <em class="emphasis">sendmail</EM
> first performs a <em class="emphasis">fork</EM
>(2).
The parent then exits, and the child becomes the daemon by disconnecting
itself from its controlling terminal. The <code class="literal">-bD</CODE
> command-line switch can be used to prevent the <em class="emphasis">fork</EM
>(2) and the detachment
and allows the <em class="emphasis">sendmail</EM
> program's behavior to be observed
while it runs in daemon mode.</P
><p class="para">As a daemon, <em class="emphasis">sendmail</EM
> does a
<em class="emphasis">listen</EM
>(2) on TCP port 25 for incoming SMTP messages.
When another site connects to the listening daemon, the daemon
performs a <em class="emphasis">fork</EM
>(2), and the child handles receipt
of the incoming mail message.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-6">36.7.6 -bH</A
></H3
><p class="refpurpose">Purge persistent host status</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52070"></A
><a class="indexterm" name="AUTOID-52073"></A
><a class="indexterm" name="AUTOID-52075"></A
>The <code class="literal">-bH</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to clear 
(purge) all the persistent host-status information
that was being saved as a result of the <code class="literal">HostStatusDirectory</CODE
> option
(see <a class="xref" href="ch34_08.htm" title="">Section 34.8.31</A
>).
Note that the <code class="literal">HostStatusDirectory</CODE
> directory is not itself removed,
but all the subdirectories under it are.
The <em class="emphasis">purgestat</EM
>(1) (see <a class="xref" href="ch36_01.htm" title="purgestat (V8.8 and Above)">Section 36.1.4</A
>)
command-line command is a synonym for this switch.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-7">36.7.7 -bh</A
></H3
><p class="refpurpose">Print persistent host status</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52092"></A
><a class="indexterm" name="AUTOID-52095"></A
><a class="indexterm" name="AUTOID-52097"></A
>The <code class="literal">-bh</CODE
> command-line switch is a synonym for the
<em class="emphasis">hoststat</EM
>(1) command-line command.
It causes <em class="emphasis">sendmail</EM
> to print its persistent host status and exit.
See <a class="xref" href="ch36_01.htm" title="hoststat (V8.8 and Above)">Section 36.1.1</A
> for a description of this output.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-8">36.7.8 -bi</A
></H3
><p class="refpurpose">Initialize alias database</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52112"></A
><a class="indexterm" name="AUTOID-52115"></A
><a class="indexterm" name="AUTOID-52118"></A
>The <code class="literal">-bi</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to rebuild
its <em class="emphasis">aliases</EM
>(5) database, and exit. This switch is
described in <a class="xref" href="ch24_05.htm#SML2-CH-24-SECT-5-1" title="Rebuild the Alias Database">Section 24.5.1</A
>.
The name <em class="emphasis">newaliases</EM
> and
the (obsolete) <code class="literal">-I</CODE
> command-line switch are synonyms for this mode.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-9">36.7.9 -bm</A
></H3
><p class="refpurpose">Be a mail sender</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52135"></A
><a class="indexterm" name="AUTOID-52138"></A
>The <code class="literal">-bm</CODE
> command-line switch (the default) causes <em class="emphasis">sendmail</EM
>
to run once in the foreground. A list of recipients is taken from
the command line (unless the <code class="literal">-t</CODE
> command-line switch is used), and the message
is read from the standard input and delivered.</P
><p class="para">This is the mode MUAs use when they
invoke <em class="emphasis">sendmail</EM
> on the user's behalf. The <em class="emphasis">sendmail</EM
>
program processes the recipients first, then the message header,
then the message body. Usually, the envelope recipients are those on the
command line. But if the <code class="literal">-t</CODE
> command-line switch is also used,
the recipients are taken from the message header.
The envelope sender is more difficult to determine:</P
><ul class="itemizedlist"><li class="listitem"><p class="para">Trusted users, and programs running under the identity of those users,
may specify the address of the sender by using either the <code class="literal">-f</CODE
> 
or the <code class="literal">-r</CODE
> command-line switch (see <a class="xref" href="#SML2-CH-36-SECT-7-21" title="">Section 36.7.21</A
>)
when running <em class="emphasis">sendmail</EM
>.
Trusted users are those that are declared with a <code class="literal">T</CODE
> configuration command 
(see <a class="xref" href="ch22_08.htm#SML2-CH-22-SECT-8-1" title="Declare trusted users (not V8.1 through V8.6)">Section 22.8.1.1, "Declare trusted users (not V8.1 through V8.6)"</A
>).</P
></LI
><li class="listitem"><p class="para">Otherwise, <em class="emphasis">sendmail</EM
> tries to use the
user identity of the invoking program to determine the sender.</P
></LI
><li class="listitem"><p class="para">When generating a mail bounce message, the header sender becomes the name specified
by the value of the <code class="literal">$n</CODE
> macro (see <a class="xref" href="ch31_10.htm" title="">Section 31.10.26</A
>),
usually <em class="emphasis">mailer-daemon</EM
>.</P
></LI
></UL
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-10">36.7.10 -bp</A
></H3
><p class="refpurpose">Print the queue</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52173"></A
><a class="indexterm" name="AUTOID-52176"></A
><a class="indexterm" name="AUTOID-52179"></A
>The <code class="literal">-bp</CODE
> command-line switch is a synonym for <em class="emphasis">mailq</EM
>(3).
See <a class="xref" href="ch23_04.htm" title="Printing the Queue">Section 23.4</A
> for a full description of how
to use this command-line switch.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-11">36.7.11 -bs</A
></H3
><p class="refpurpose">Run SMTP on standard input</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52193"></A
><a class="indexterm" name="AUTOID-52196"></A
><a class="indexterm" name="AUTOID-52199"></A
>The <code class="literal">-bs</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to run
one time in the foreground, collect an SMTP message over its
standard input and output, deliver the message, and exit.</P
><p class="para">This mode is intended for use at sites that wish to run <em class="emphasis">sendmail</EM
>
with the <em class="emphasis">inetd</EM
>(3) daemon. To implement this, place an entry
like the following in your <em class="emphasis">inetd.conf</EM
>(5) file, then restart 
<em class="emphasis">inetd</EM
>(3) by killing it with a SIGHUP signal:</P
><p class="para"><blockquote class="screen"><pre class="screen">smtp   stream  tcp   nowait  root /usr/lib/sendmail sendmail -bs</PRE
></BLOCKQUOTE
></P
><p class="para">With this scheme it is important to either use <em class="emphasis">cron</EM
>(3) to
run <em class="emphasis">sendmail</EM
> periodically to process its queue:
[6]</P
><blockquote class="footnote"><p class="para">[6] The look of these lines varies depending on the version of
UNIX you are running.</P
></BLOCKQUOTE
><p class="para"><blockquote class="screen"><pre class="screen">0 * * * * /usr/lib/sendmail -q</PRE
></BLOCKQUOTE
></P
><p class="para">or run <em class="emphasis">sendmail</EM
> in the background to process the queue
periodically by specifying an interval to <code class="literal">-q</CODE
> (see <a class="xref" href="ch23_06.htm#SML2-CH-23-SECT-6-1" title="Periodically with -q">Section 23.6.1</A
>):</P
><p class="para"><blockquote class="screen"><pre class="screen">/usr/lib/sendmail -q1h</PRE
></BLOCKQUOTE
></P
><p class="para">There are advantages and disadvantages in using <em class="emphasis">inetd</EM
>(3)
instead of the <code class="literal">-bd</CODE
> daemon mode to listen for and process
incoming SMTP messages. The advantages are the following:</P
><ul class="itemizedlist"><li class="listitem"><p class="para">At security-conscious sites, <em class="emphasis">sendmail</EM
> can be hidden behind
a <em class="emphasis">tcpd</EM
>(3) or <em class="emphasis">miscd</EM
>(3) wrapper that can selectively
accept or reject connections. (But see TCPWRAPPERS in <a class="xref" href="ch18_08.htm" title="">Section 18.8.49, TCPWRAPPERS</A
>
for a way to include this support directly inside <em class="emphasis">sendmail</EM
>.)</P
></LI
><li class="listitem"><p class="para">At hosts that receive few incoming mail messages, this mode
avoids the need to run a daemon.</P
></LI
></UL
><p class="para">&#13;The disadvantages are the following:</P
><ul class="itemizedlist"><li class="listitem"><p class="para">At sites that receive many incoming mail messages, this mode
causes a new <em class="emphasis">sendmail</EM
> process to be started for each
connection. Compared to daemon mode, this can adversely affect
system performance.</P
></LI
><li class="listitem"><p class="para">At highly loaded sites, this mode circumvents the <em class="emphasis">sendmail</EM
>
program options that are intended to avoid overloading the system with too
many concurrent <em class="emphasis">sendmail</EM
> processes.</P
></LI
></UL
><p class="para">In general, the <em class="emphasis">inetd</EM
>(3) approach should be used only on
lightly loaded machines that receive few SMTP connections.</P
><p class="para">The <code class="literal">-bs</CODE
> switch is also useful for MUAs
that prefer to use SMTP rather than a pipe to transfer a mail message
to <em class="emphasis">sendmail</EM
>. Depending on how it is configured, <em class="emphasis">mh</EM
>(1)
can use this feature.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-12">36.7.12 -bt</A
></H3
><p class="refpurpose">Rule testing mode</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52259"></A
><a class="indexterm" name="AUTOID-52262"></A
><a class="indexterm" name="AUTOID-52264"></A
>The <code class="literal">bt</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to
run in rule-testing mode. This mode is covered in detail in <a class="xref" href="ch38_01.htm" title="Overview">Section 38.1</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-13">36.7.13 -bv</A
></H3
><p class="refpurpose">Verify: don't collect or deliver</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52278"></A
><a class="indexterm" name="AUTOID-52281"></A
>The <code class="literal">-bv</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to
verify the list of recipients. Each recipient in the
list of recipients is fully processed up to the point of
delivery without actually being delivered.
If mail can be successfully delivered to a recipient, <em class="emphasis">sendmail</EM
>
prints a line like one of the following:</P
><p class="para"><blockquote class="screen"><pre class="screen"><code class="replaceable"><i>name</I
></CODE
> ...deliverable
<code class="replaceable"><i>name</I
></CODE
> ...deliverable: mailer <i class="lineannotation">$# value</I
>, host <i class="lineannotation">$@ value</I
>, user <i class="lineannotation">$: value</I
></PRE
></BLOCKQUOTE
></P
><p class="para">The first form is that of pre-V8 <em class="emphasis">sendmail</EM
>. The second form began
with V8.1 <em class="emphasis">sendmail</EM
>.</P
><p class="para">The <code class="replaceable"><i>name</I
></CODE
> is the original recipient address after
it has undergone aliasing and rule set rewriting. A local user's
name expands to the contents of that user's <em class="emphasis">.forward</EM
> file.
A mailing list expands to many names (and produces many lines
of output).
The <code class="literal">mailer</CODE
>, <code class="literal">host</CODE
>, and <code class="literal">user</CODE
> correspond to the
<em class="emphasis">triple</EM
> returned by rule set 0 (see <a class="xref" href="ch29_06.htm#SML2-CH-29-SECT-6-1" title="Rule Set 0">Section 29.6</A
>).
If no <code class="literal">$@</CODE
> is returned, the <code class="literal">host</CODE
> part is omitted from this output.</P
><p class="para">If the recipient cannot be delivered to,
<em class="emphasis">sendmail</EM
> instead prints the following:</P
><p class="para"><blockquote class="screen"><pre class="screen"><code class="replaceable"><i>name</I
></CODE
> ...<i class="lineannotation">reason recipient is undeliverable</I
></PRE
></BLOCKQUOTE
></P
><p class="para">&#13;The <em class="emphasis">reason</EM
> can be any of many possible error messages (such as
&quot;No such user&quot;) that would prevent successful delivery.</P
><p class="para">The <code class="literal">-bv</CODE
> switch also prevents <em class="emphasis">sendmail</EM
> from collecting
any mail message from its standard input unless the <code class="literal">-t</CODE
> command-line
switch (see <a class="xref" href="#SML2-CH-36-SECT-7-38" title="">Section 36.7.38</A
>) is also given.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-14">36.7.14 -bz</A
></H3
><p class="refpurpose">Freeze the configuration file</P
>(Not V8)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52327"></A
><a class="indexterm" name="AUTOID-52330"></A
><a class="indexterm" name="AUTOID-52333"></A
>Prior to V8 <em class="emphasis">sendmail</EM
> the <code class="literal">-bz</CODE
> command-line switch caused <em class="emphasis">sendmail</EM
> to
build (or rebuild) its frozen configuration file (now obsolete).
The frozen configuration file was just a simple image of <em class="emphasis">sendmail</EM
>'s
variables after it had read and parsed the configuration file.
The purpose of the frozen file was to enable <em class="emphasis">sendmail</EM
> to start
up more swiftly than it could when parsing the configuration file
from scratch.
[7]</P
><blockquote class="footnote"><p class="para">[7] In practice, freeze files helped you only on systems
with very fast I/O systems relative to their CPU speeds.
Although this was true in the day of the VAX 11/750,
improvements in processor technology have reversed this tradeoff.</P
></BLOCKQUOTE
><p class="para">The <code class="literal">-bz</CODE
> command-line switch is obsolete. If you use it
with V8 <em class="emphasis">sendmail</EM
>, you will see this error message:</P
><p class="para"><blockquote class="screen"><pre class="screen">Frozen configurations unsupported</PRE
></BLOCKQUOTE
></P
><p class="para"><a class="indexterm" name="AUTOID-52348"></A
></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-15">36.7.15 -C</A
></H3
><p class="refpurpose">Location of the configuration file</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52357"></A
><a class="indexterm" name="AUTOID-52359"></A
>The <code class="literal">-C</CODE
> command-line switch tells <em class="emphasis">sendmail</EM
> where
to find its configuration file. The form of the <code class="literal">-C</CODE
>
switch is:</P
><p class="para"><blockquote class="screen"><pre class="screen">-C <code class="replaceable"><i>path</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Space between the <code class="literal">-C</CODE
> and the <code class="replaceable"><i>path</I
></CODE
> is optional.
The <code class="replaceable"><i>path</I
></CODE
> specifies
the location of the configuration file. That location may be
either a relative or a full pathname.
If <code class="replaceable"><i>path</I
></CODE
> is missing, the location becomes 
the file <em class="emphasis">sendmail.cf</EM
> in the current directory.</P
><p class="para">The <code class="literal">-C</CODE
> command-line switch
causes <em class="emphasis">sendmail</EM
> to internally mark the configuration file as
unsafe. An unsafe configuration file
prevents all but <em class="emphasis">root</EM
> from setting certain
options and causes <em class="emphasis">sendmail</EM
>
to change its <em class="emphasis">uid</EM
> and <em class="emphasis">gid</EM
> to that of the user that ran it. If it is used

by someone other than the superuser (and if in other than <code class="literal">-bt</CODE
> rule-testing
mode), the <code class="literal">-oQ</CODE
> switch should
also be used to set the location of the queue directory. If that
location is not changed, <em class="emphasis">sendmail</EM
> fails because it cannot
<em class="emphasis">chdir</EM
>(2) into its queue directory.</P
><p class="para">Prior to V8
the <code class="literal">-C</CODE
> command-line switch also prevented <em class="emphasis">sendmail</EM
> from
&quot;thawing&quot; its frozen configuration file. </P
><p class="para"></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-16">36.7.16 -c</A
></H3
><p class="refpurpose">Set HoldExpensive (c) option to true</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52397"></A
><a class="indexterm" name="AUTOID-52399"></A
>The <code class="literal">-c</CODE
> command-line switch is a synonym for the 
<code class="literal">HoldExpensive</CODE
> (<code class="literal">c</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.29</A
>).</P
><p class="para">As of V8, this command-line switch has been deprecated and
may not be in future versions.</P
><p class="para"></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-17">36.7.17 -d</A
></H3
><p class="refpurpose">Enter debugging mode</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52415"></A
><a class="indexterm" name="AUTOID-52417"></A
>The <code class="literal">-d</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to
run in debugging mode. This switch is described in gory
detail in <a class="xref" href="ch37_01.htm" title="The Syntax of -d">Section 37.1</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-18">36.7.18 -E</A
></H3
><p class="refpurpose">Japanese font conversion</P
>(Sony NEWS only)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52430"></A
><a class="indexterm" name="AUTOID-52432"></A
><a class="indexterm" name="AUTOID-52434"></A
><a class="indexterm" name="AUTOID-52437"></A
>The <code class="literal">-E</CODE
> switch is reserved for the Sony NEWS adaptation
of <em class="emphasis">sendmail</EM
>. It is ignored by the Berkeley release of V8
<em class="emphasis">sendmail</EM
> and produces no errors if used by that version.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-19">36.7.19 -e</A
></H3
><p class="refpurpose">Set the ErrorMode (e) option's mode</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52450"></A
><a class="indexterm" name="AUTOID-52452"></A
>The <code class="literal">-e</CODE
> command-line switch is a synonym for the
<code class="literal">ErrorMode</CODE
> (<code class="literal">e</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.24</A
>).</P
><p class="para">The <code class="literal">-e</CODE
> command-line switch is deprecated and may not
be in future versions.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-20">36.7.20 -F</A
></H3
><p class="refpurpose">Set the sender's full name</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52468"></A
><a class="indexterm" name="AUTOID-52471"></A
><a class="indexterm" name="AUTOID-52473"></A
>The <code class="literal">-F</CODE
> command-line switch specifies
the full name for the sender, which is used
in mail headers and the envelope. The form of the <code class="literal">-F</CODE
>
switch is:</P
><p class="para"><blockquote class="screen"><pre class="screen">-F<code class="replaceable"><i>fullname</I
></CODE
>
-F <code class="replaceable"><i>fullname</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Space between the <code class="literal">-F</CODE
> and the <code class="replaceable"><i>fullname</I
></CODE
> is optional.
If <code class="replaceable"><i>fullname</I
></CODE
> is missing and the <code class="literal">-F</CODE
> is the last argument,
<em class="emphasis">sendmail</EM
> prints the following error and exits:</P
><p class="para"><blockquote class="screen"><pre class="screen">sendmail: option requires an argument - F</PRE
></BLOCKQUOTE
></P
><p class="para">If the <code class="literal">-F</CODE
> is followed by any other switches, the
following switch is taken as the full name.</P
><p class="para">When specifying the sender's full name, be sure
to quote any internal spaces or shell special characters. For example,
for the C shell the following would be needed to specify
the full name <code class="literal">Happy Guy!</CODE
>:</P
><p class="para"><blockquote class="screen"><pre class="screen">&quot;Happy Guy\!&quot;</PRE
></BLOCKQUOTE
></P
><p class="para">In the absence of this switch, sendmail finds
the sender's full name in any of several places.
These are described in the section discussing the <code class="literal">$x</CODE
> macro
(see <a class="xref" href="ch31_10.htm" title="">Section 31.10.42, $x</A
>).</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-21">36.7.21 -f and -r</A
></H3
><p class="refpurpose">Set sender's address</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52506"></A
><a class="indexterm" name="AUTOID-52508"></A
>The <code class="literal">-f</CODE
> and <code class="literal">-r</CODE
> command-line switches are interchangeable.
[8]
Either causes <em class="emphasis">sendmail</EM
> to take the address of the sender
from the command line rather than from the envelope or message header.
The <code class="literal">-f</CODE
> switch is used by UUCP software
and by mailing list software.
The form of the <code class="literal">-f</CODE
> switch is:</P
><blockquote class="footnote"><p class="para">[8] The only difference is that the <code class="literal">-r</CODE
> command-line switch is deprecated,
and there is no guarantee that it will be included in future versions
of <em class="emphasis">sendmail</EM
>.</P
></BLOCKQUOTE
><p class="para"><blockquote class="screen"><pre class="screen">-f<code class="replaceable"><i>addr</I
></CODE
>
-f <code class="replaceable"><i>addr</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Space between the <code class="literal">-f</CODE
> and the <code class="replaceable"><i>addr</I
></CODE
> is optional. If
<code class="replaceable"><i>addr</I
></CODE
> is missing, <em class="emphasis">sendmail</EM
> prints the following
error message and ignores the <code class="literal">-f</CODE
> switch:</P
><p class="para"><blockquote class="screen"><pre class="screen">sendmail: option requires an argument - f</PRE
></BLOCKQUOTE
></P
><p class="para">Multiple <code class="literal">-f</CODE
> switches cause <em class="emphasis">sendmail</EM
> to print
the following error message and exit:</P
><p class="para"><blockquote class="screen"><pre class="screen">More than one &quot;from&quot; person</PRE
></BLOCKQUOTE
></P
><p class="para">The behavior of this switch varies depending on the version of
<em class="emphasis">sendmail</EM
> you are running.</P
><p class="para">Prior to V8
the <em class="emphasis">uid</EM
> of the user specifying the <code class="literal">-f</CODE
>
switch must match one of the usernames given in the <code class="literal">T</CODE
>
configuration command. If they do not match, <em class="emphasis">sendmail</EM
> silently
ignores the option and determines the sender's address in the usual ways.</P
><p class="para">From V8.1 through V8.6 the <code class="literal">T</CODE
> configuration command was
eliminated. If the <code class="literal">-f</CODE
> or <code class="literal">-r</CODE
> switch was used, and if
the <code class="literal">p</CODE
> (privacy) option was given <code class="literal">authwarnings</CODE
>, <em class="emphasis">sendmail</EM
>
included an <code class="literal">X-Authentication-Warning:</CODE
> header in the
mail message. That header warned that the identity of the sender
had changed.</P
><p class="para">Beginning with <code class="literal">V8.7</CODE
> <em class="emphasis">sendmail</EM
>, the <code class="literal">T</CODE
>
was reintroduced, but in a different form (see <a class="xref" href="ch22_08.htm#SML2-CH-22-SECT-8-1" title="Trusted Users">Section 22.8.1, "Trusted Users"</A
>).
First <em class="emphasis">sendmail</EM
> checks to see whether the user specified by the
<code class="literal">-f</CODE
> is the same as the login name of the user running <em class="emphasis">sendmail</EM
>,
as would be the case for <em class="emphasis">mh</EM
>(1). If they are the same, <em class="emphasis">sendmail</EM
>
silently accepts the address. If they differ, <em class="emphasis">sendmail</EM
> looks to
see whether the login name of the user running <em class="emphasis">sendmail</EM
> is in the
class <code class="literal">$=t</CODE
>. If it is, <em class="emphasis">sendmail</EM
> silently accepts the address.
If not, <em class="emphasis">sendmail</EM
> checks to see if <code class="literal">authwarnings</CODE
> is set
for the <code class="literal">PrivacyOptions</CODE
> (<code class="literal">p</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.47, PrivacyOptions (p)</A
>).
If it is, the following warning is logged and included in the outgoing message:</P
><p class="para"><blockquote class="screen"><pre class="screen">X-Authentication-Warning: <i class="lineannotation">login</I
> set sender to <i class="lineannotation">new name</I
> using -f</PRE
></BLOCKQUOTE
></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-22">36.7.22 -h</A
></H3
><p class="refpurpose">Initial hop count</P
>(deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52582"></A
><a class="indexterm" name="AUTOID-52584"></A
>A &quot;hop&quot; is the transmittal of a
mail message from one machine to another. Many such hops may be
required to deliver a message. The number of hops (the hop count)
is determined by counting the number of <code class="literal">Received:</CODE
>
[9]
header lines in the header portion of an email message.
The maximum number of allowable hops is compiled-in for most versions
of <em class="emphasis">sendmail</EM
> but is set by the <code class="literal">MaxHopCount</CODE
> (<code class="literal">h</CODE
>) option with V8.
When the hop count for a message exceeds the limit set by the
<code class="literal">MaxHopCount</CODE
> (<code class="literal">h</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.36, MaxHopCount (h)</A
>),
the message is bounced.  Ordinarily, the count begins at zero.
The <code class="literal">-h</CODE
> command-line switch is used to specify a minimum hop count.
[10]
The forms for the <code class="literal">-h</CODE
> command-line switch are:</P
><blockquote class="footnote"><p class="para">[9] Actually, all headers marked with the H_TRACE flag in
<em class="emphasis">conf.c</EM
> (see <a class="xref" href="ch35_05.htm#SML2-CH-35-SECT-5-6" title="H_TRACE">Section 35.5.8, "H_TRACE"</A
>) are counted.</P
><p class="para">[10] The first edition to this book and the documentation that came with <em class="emphasis">sendmail</EM
>
both wrongly stated that the <code class="literal">-h</CODE
> switch set a beginning count.</P
></BLOCKQUOTE
><p class="para"><blockquote class="screen"><pre class="screen">-h<code class="replaceable"><i>num</I
></CODE
>
-h <code class="replaceable"><i>num</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Space between the <code class="literal">-h</CODE
> and <code class="replaceable"><i>num</I
></CODE
> is optional. If <code class="replaceable"><i>num</I
></CODE
>
is missing, <em class="emphasis">sendmail</EM
> prints the following error message
and ignores that switch:</P
><p class="para"><blockquote class="screen"><pre class="screen">sendmail: option requires an argument - h</PRE
></BLOCKQUOTE
></P
><p class="para">If <code class="replaceable"><i>num</I
></CODE
> begins with a character other than a digit, the 
offending text is printed:</P
><p class="para"><blockquote class="screen"><pre class="screen">Bad hop count (<i class="lineannotation">bad text</I
>)</PRE
></BLOCKQUOTE
></P
><p class="para">The failure above illustrates that the minimum hop count must
be positive.</P
><p class="para">The <code class="literal">-h</CODE
> switch was originally used by BerkNet to carry the hop
count in the envelope. It currently has no application.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-23">36.7.23 -I</A
></H3
><p class="refpurpose">Synonym for -bi</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52630"></A
>The <code class="literal">-I</CODE
> command-line switch is a synonym for the <code class="literal">-bi</CODE
>
command-line switch and the <em class="emphasis">newaliases</EM
> name.
It is obsolete, but retained for compatibility
with the <em class="emphasis">delivermail</EM
>(1)
program (the precursor to <em class="emphasis">sendmail</EM
>).</P
><p class="para">The <code class="literal">-I</CODE
> switch is deprecated and may not
be included in future versions of <em class="emphasis">sendmail</EM
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-24">36.7.24 -i</A
></H3
><p class="refpurpose">Set the IgnoreDots (i) option to true</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52648"></A
><a class="indexterm" name="AUTOID-52650"></A
>The <code class="literal">-i</CODE
> command-line switch is a synonym for the
<code class="literal">IgnoreDots</CODE
> (<code class="literal">i</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.32, IgnoreDots (i)</A
>).</P
><p class="para">The <code class="literal">-i</CODE
> switch is deprecated and may
not be included in future versions.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-25">36.7.25 -J</A
></H3
><p class="refpurpose">Japanese font conversion</P
>(Sony NEWS only)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52666"></A
><a class="indexterm" name="AUTOID-52668"></A
><a class="indexterm" name="AUTOID-52670"></A
><a class="indexterm" name="AUTOID-52673"></A
>The <code class="literal">-J</CODE
> switch is reserved for the Sony NEWS adaptation
of <em class="emphasis">sendmail</EM
>. It is ignored by the Berkeley release of V8
<em class="emphasis">sendmail</EM
> and produces no errors if used by that version.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-26">36.7.26 -M</A
></H3
><p class="refpurpose">Define a macro on the command line</P
>(V8.7 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52686"></A
><a class="indexterm" name="AUTOID-52688"></A
><a class="indexterm" name="AUTOID-52691"></A
>The <code class="literal">-M</CODE
> command-line switch is used to assign a macro a value.
Note that prior to V8.8, only single-character macro names could be defined.
The <code class="literal">-M</CODE
> command-line switch is fully described in <a class="xref" href="ch31_02.htm" title="Command-Line Definitions">Section 31.2</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-27">36.7.27 -m</A
></H3
><p class="refpurpose">Set the MeToo (m) option to true</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52705"></A
><a class="indexterm" name="AUTOID-52707"></A
>The <code class="literal">-m</CODE
> command-line switch is a synonym for the <code class="literal">MeToo</CODE
>
(<code class="literal">m</CODE
>) option. It is used to set that option to true.
The <code class="literal">-m</CODE
> command line switch is fully described in <a class="xref" href="ch34_08.htm" title="">Section 34.8.39</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-28">36.7.28 -N</A
></H3
><p class="refpurpose">Specify DSN NOTIFY information</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52722"></A
><a class="indexterm" name="AUTOID-52724"></A
><a class="indexterm" name="AUTOID-52727"></A
><a class="indexterm" name="AUTOID-52729"></A
>The <code class="literal">-N</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to
append the DSN NOTIFY command to the ESMTP
RCPT command. For example:</P
><p class="para"><blockquote class="screen"><pre class="screen">RCPT To:&lt;<code class="replaceable"><i>friend@other.site</I
></CODE
>&gt; NOTIFY=SUCCESS</PRE
></BLOCKQUOTE
></P
><p class="para">Here, <em class="emphasis">sendmail</EM
> is requesting that the other site return
notification of successful delivery. Should the message be successfully
delivered by a host that understands DSN, a return message
will be sent to the sender. If the other site is running V8.8 <em class="emphasis">sendmail</EM
>,
that return message will look (in part) like this:</P
><p class="para"><blockquote class="screen"><pre class="screen">Date: Fri, 13 Dec 96 08:11:43 -0800 (PST)
From: Mail Delivery Subsystem &lt;MAILER-DAEMON&gt;
Subject: Return receipt
Message-Id: &lt;199612132144.PAA09881@other.site&gt;
To: &lt;you@your.site&gt;
MIME-Version: 1.0
Content-Type: multipart/report; report-type=delivery-status;
        boundary=&quot;PAA09881.834702270/other.site
Auto-Submitted: auto-generated (return-receipt)

This is a MIME-encapsulated message

-PAA09881.834702270/other.site

The original message was received at Fri, 13 Dec 96 08:11:43 -0800 (PST)
from other.site [204.255.152.62]

   --- The following addresses had successful delivery notifications ---
friend (successfully delivered to mailbox)</PRE
></BLOCKQUOTE
></P
><p class="para">The <code class="literal">-N</CODE
> command-line switch tells the NOTIFY command what to include and thus tunes how notification will be handled. The form of the
<code class="literal">-N</CODE
> command-line switch looks like this:</P
><p class="para"><blockquote class="screen"><pre class="screen">-Nnever
-N<code class="replaceable"><i>keyword,keyword,...</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">The first form sets NOTIFY to be NEVER, meaning
send no notification.
The second form tells NOTIFY to specify notification based on
one or more of three possibilities:</P
><dl class="variablelist"><dt class="term"><code class="literal">success</CODE
></DT
><dd class="listitem"><p class="para">The <code class="literal">success</CODE
> keyword tells <em class="emphasis">sendmail</EM
> to ask for notification
of successful final delivery.</P
></DD
><dt class="term"><code class="literal">failure</CODE
></DT
><dd class="listitem"><p class="para">The <code class="literal">failure</CODE
> keyword tells <em class="emphasis">sendmail</EM
> to ask for notification
if the message fails to be delivered.</P
></DD
><dt class="term"><code class="literal">delay</CODE
></DT
><dd class="listitem"><p class="para">The <code class="literal">delay</CODE
> keyword tells <em class="emphasis">sendmail</EM
> to ask for notification
if the message is delayed for any reason.</P
></DD
></DL
><p class="para">These keywords can be listed after the <code class="literal">-N</CODE
> to set a combination
of notification requests. For example,</P
><p class="para"><blockquote class="screen"><pre class="screen">-Ndelay,success</PRE
></BLOCKQUOTE
></P
><p class="para">tells <em class="emphasis">sendmail</EM
> to ask for notification if the message is successfully
delivered or delayed but not to get notification if the message fails.</P
><p class="para">If an unknown keyword is listed, <em class="emphasis">sendmail</EM
> prints the following
error message and ignores the bad keyword:</P
><p class="para"><blockquote class="screen"><pre class="screen">Invalid -N argument</PRE
></BLOCKQUOTE
></P
><p class="para">If the <code class="literal">-N</CODE
> command-line switch is omitted, notification policy
is left to the other site.
The usual default is <code class="literal">failure</CODE
> (and possibly <code class="literal">delay</CODE
>).
On the local machine, <em class="emphasis">sendmail</EM
> acts as though both <code class="literal">failure</CODE
>
and <code class="literal">delay</CODE
> were specified.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-29">36.7.29 -n</A
></H3
><p class="refpurpose">Don't do aliasing</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52795"></A
><a class="indexterm" name="AUTOID-52797"></A
>The <code class="literal">-n</CODE
> command-line switch prevents <em class="emphasis">sendmail</EM
> from
changing local recipient addresses with aliases.
The <code class="literal">-n</CODE
> switch is fully described in  <a class="xref" href="ch24_06.htm" title="Prevent Aliasing with -n">Section 24.6</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-30">36.7.30 -O</A
></H3
><p class="refpurpose">Set multicharacter option</P
>(V8.7 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52812"></A
><a class="indexterm" name="AUTOID-52814"></A
>The <code class="literal">-O</CODE
> command-line switch is used to set a multicharacter
configuration option from the command line:</P
><p class="para"><blockquote class="screen"><pre class="screen">-O<code class="replaceable"><i>LongName</I
></CODE
>=<code class="replaceable"><i>value</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">The <code class="literal">-O</CODE
> switch is described in detail in <a class="xref" href="ch34_01.htm" title="Command-Line Options">Section 34.1</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-31">36.7.31 -o</A
></H3
><p class="refpurpose">Set a single-character option</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52833"></A
><a class="indexterm" name="AUTOID-52835"></A
><a class="indexterm" name="AUTOID-52838"></A
>The <code class="literal">-o</CODE
> command-line switch is used to set a single-character
configuration option from the command line. </P
><p class="para"><blockquote class="screen"><pre class="screen">-o<code class="replaceable"><i>Xvalue</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">The <code class="literal">-o</CODE
> switch is described in detail in <a class="xref" href="ch34_01.htm" title="Command-Line Options">Section 34.1</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-32">36.7.32 -p</A
></H3
><p class="refpurpose">Set protocol and host</P
>(V8.6 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52856"></A
><a class="indexterm" name="AUTOID-52858"></A
><a class="indexterm" name="AUTOID-52861"></A
><a class="indexterm" name="AUTOID-52864"></A
><a class="indexterm" name="AUTOID-52866"></A
>The <code class="literal">$r</CODE
> macro holds as its value the protocol that is used in
receiving a mail message (usually SMTP or UUCP;
see <a class="xref" href="ch31_10.htm" title="">Section 31.10.31, $r</A
>). The <code class="literal">$s</CODE
> macro
holds as its value the name of the sending host
(see <a class="xref" href="ch31_10.htm" title="">Section 31.10.33, $s</A
>). Some programs, such as UUCP, need to be able to set the values of these macros
from the command line. The old way to set them looked like
this:</P
><p class="para"><blockquote class="screen"><pre class="screen">-oMrUUCP -oMslady</PRE
></BLOCKQUOTE
></P
><p class="para">Here, the <code class="literal">M</CODE
> option sets <code class="literal">$r</CODE
> to be <code class="literal">UUCP</CODE
>
and <code class="literal">$s</CODE
> to be <code class="literal">lady</CODE
>.</P
><p class="para">Under V8 <em class="emphasis">sendmail</EM
> the setting of <code class="literal">$r</CODE
> and <code class="literal">$s</CODE
>
has been simplified. A command-line single switch, <code class="literal">-p</CODE
>, can be used
to set them both:</P
><p class="para"><blockquote class="screen"><pre class="screen">-p<code class="replaceable"><i>rval</I
></CODE
>:<code class="replaceable"><i>sval</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Here, the <code class="replaceable"><i>rval</I
></CODE
> is the value assigned to <code class="literal">$r</CODE
>, and the
<code class="replaceable"><i>sval</I
></CODE
> is the value assigned to <code class="literal">$s</CODE
>. The two are separated
by a colon. If the <code class="replaceable"><i>sval</I
></CODE
> is omitted, the colon should also
be omitted.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-33">36.7.33 -q</A
></H3
><p class="refpurpose">Process the queue</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52903"></A
><a class="indexterm" name="AUTOID-52905"></A
><a class="indexterm" name="AUTOID-52908"></A
>The <code class="literal">-q</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to process
its queue once or periodically, depending on its arguments.
The <code class="literal">-q</CODE
> switch is described in detail in <a class="xref" href="ch23_06.htm#SML2-CH-23-SECT-6-1" title="Periodically with -q">Section 23.6.1</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-34">36.7.34 -R</A
></H3
><p class="refpurpose">DSN what to return on a bounce</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52923"></A
><a class="indexterm" name="AUTOID-52925"></A
><a class="indexterm" name="AUTOID-52927"></A
>The <code class="literal">-R</CODE
> command-line switch tells <em class="emphasis">sendmail</EM
> to include
the DSN RET command with an ESMTP MAIL command:</P
><p class="para"><blockquote class="screen"><pre class="screen">MAIL From:&lt;you@your.host&gt; RET=full
MAIL From:&lt;you@your.host&gt; RET=hdrs</PRE
></BLOCKQUOTE
></P
><p class="para">The RET command tells the receiving site whether or
not to include a copy of the original message body in
the bounced mail notification. RET=<code class="literal">full</CODE
> causes both headers and
the message body to be returned. RET=<code class="literal">hdrs</CODE
> causes only headers
to be returned. The RET= command is binding on
the receiving site only if it agrees to handle the DSN extension to
ESMTP. In the absence of RET or remote DSN support,
the receiving site is free to return the message body
if it so desires.</P
><p class="para">The RET, and hence this <code class="literal">-R</CODE
> command-line switch, is useful
in two circumstances:</P
><ul class="itemizedlist"><li class="listitem"><p class="para">For users sending email, this should be set to <code class="literal">full</CODE
> so that
any bounced mail will include the original message body. This helps to
reduce the need for users to archive their outgoing mail.</P
></LI
><li class="listitem"><p class="para">For mailing-list mailings or other batched broadcast messages,
this should be set to <code class="literal">hdrs</CODE
> so that only the header portion
of the bounced message will be returned.</P
></LI
></UL
><p class="para">The form of the <code class="literal">-R</CODE
> command line switch looks like this:</P
><p class="para"><blockquote class="screen"><pre class="screen">-R <code class="replaceable"><i>arg</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Space between the <code class="literal">-R</CODE
> and its argument is optional.
The <code class="replaceable"><i>arg</I
></CODE
>
must be present and must be either <code class="literal">hdrs</CODE
> (return only headers)
or <code class="literal">full</CODE
> (return the body too). If it is any other value, the following
error is printed and the setting defaults to <code class="literal">full</CODE
>:</P
><p class="para"><blockquote class="screen"><pre class="screen">Invalid -R value</PRE
></BLOCKQUOTE
></P
><p class="para">The <code class="literal">-R</CODE
> command-line switch may appear only once in the command
line. If it appears multiple times, the second and subsequent appearances
will result in this error message:</P
><p class="para"><blockquote class="screen"><pre class="screen">Duplicate -R flag</PRE
></BLOCKQUOTE
></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-35">36.7.35 -r</A
></H3
><p class="refpurpose">Set sender's address</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52971"></A
><a class="indexterm" name="AUTOID-52973"></A
>The <code class="literal">-r</CODE
> command-line switch is a synonym for the <code class="literal">-f</CODE
>
command-line switch. This <code class="literal">-r</CODE
> command-line switch is deprecated
and may not be included in future versions.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-36">36.7.36 -s</A
></H3
><p class="refpurpose">Set the SaveFromLine (f) option to true</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-52986"></A
><a class="indexterm" name="AUTOID-52988"></A
>The <code class="literal">-s</CODE
> command-line switch tells <em class="emphasis">sendmail</EM
> to set the
<code class="literal">SaveFromLine</CODE
> (<code class="literal">f</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.59</A
>)
to true.
This <code class="literal">-s</CODE
> command-line switch is deprecated and may not be
in future versions.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-37">36.7.37 -T</A
></H3
><p class="refpurpose">Set QueueTimeout (T) option</P
>(Deprecated)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53004"></A
><a class="indexterm" name="AUTOID-53006"></A
>The <code class="literal">-T</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to set the
<code class="literal">QueueTimeout</CODE
> (<code class="literal">T</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.52</A
>)
to the value specified.
This <code class="literal">-T</CODE
> command-line switch is deprecated (as is the
<code class="literal">QueueTimeout</CODE
> (<code class="literal">T</CODE
>) option) in favor of the
<code class="literal">Timeout</CODE
> option of V8.7 <em class="emphasis">sendmail</EM
> (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.70, Timeout (r)</A
>),
and  may not be in future versions.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-38">36.7.38 -t</A
></H3
><p class="refpurpose">Get recipients from message header</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53027"></A
><a class="indexterm" name="AUTOID-53030"></A
><a class="indexterm" name="AUTOID-53033"></A
>The <code class="literal">-t</CODE
> command-line switch causes <em class="emphasis">sendmail</EM
> to gather
its list of recipients from the message's header in addition to
gathering them from
its command line. The <code class="literal">-t</CODE
> switch takes no arguments.</P
><p class="para">When this switch is specified, <em class="emphasis">sendmail</EM
> gathers recipient names
from the <code class="literal">To:</CODE
>, <code class="literal">Cc:</CODE
>, and <code class="literal">Bcc:</CODE
> header
lines. It also gathers recipient names from its command line if any
were listed there. Duplicates are discarded, and the message is delivered
to all that remain.</P
><p class="para">The <code class="literal">-t</CODE
> switch is intended for use by MUAs.
It should <em class="emphasis">never</EM
> be specified when <em class="emphasis">sendmail</EM
> is run in daemon mode.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-39">36.7.39 -U</A
></H3
><p class="refpurpose">This is the initial MUA to MTA submission</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53055"></A
><a class="indexterm" name="AUTOID-53057"></A
>The <code class="literal">-U</CODE
> command-line switch is used to tell <em class="emphasis">sendmail</EM
>
that this is the very first step in this email message's submission.</P
><p class="para">As of V8.8, this switch does nothing. When MUAs start
to use this switch, it will do things like turning on
DNS canonification of the initial addresses.
It should <em class="emphasis">always</EM
> be set by MUAs doing initial
submission of a message.</P
><p class="para">This switch has been instituted as parallel support for the XUSR
extension to ESMTP.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-40">36.7.40 -V</A
></H3
><p class="refpurpose">Specify the ENVID string</P
>(V8.8 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53072"></A
><a class="indexterm" name="AUTOID-53074"></A
><a class="indexterm" name="AUTOID-53077"></A
><a class="indexterm" name="AUTOID-53080"></A
>The <code class="literal">-V</CODE
> command-line switch is used to specify the
envelope identifier for the outgoing message. That identifier
is called the ENVID and
is part of the DSN extension to ESMTP.
ENVID and the <code class="literal">${envid}</CODE
> macro are
fully discussed in <a class="xref" href="ch31_10.htm" title="">Section 31.10.12, ${envid}</A
>.</P
><p class="para">The form of the <code class="literal">-V</CODE
> command-line switch looks like this:</P
><p class="para"><blockquote class="screen"><pre class="screen">-V<code class="replaceable"><i>envid</I
></CODE
>
-V <code class="replaceable"><i>envid</I
></CODE
></PRE
></BLOCKQUOTE
></P
><p class="para">Space between the <code class="literal">-V</CODE
> and its argument is optional.
The <code class="replaceable"><i>envid</I
></CODE
> must be a legal ENVID identifier 
(see <a class="xref" href="ch31_10.htm" title="">Section 31.10.12</A
>).
If an illegal character is specified in <code class="replaceable"><i>envid</I
></CODE
>, the following
error is printed, and that declaration is ignored:</P
><p class="para"><blockquote class="screen"><pre class="screen">Invalid syntax in -V flag</PRE
></BLOCKQUOTE
></P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-41">36.7.41 -v</A
></H3
><p class="refpurpose">Run in verbose mode</P
>(All versions)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53107"></A
><a class="indexterm" name="AUTOID-53109"></A
>The <code class="literal">-v</CODE
> command-line switch tells <em class="emphasis">sendmail</EM
> to run in verbose
mode. In that mode, <em class="emphasis">sendmail</EM
> prints a blow-by-blow description
of all the steps it takes in delivering a mail message.</P
><p class="para">After the <em class="emphasis">sendmail.cf</EM
> file is parsed and after the command-line
arguments have been processed, <em class="emphasis">sendmail</EM
> checks to see whether it
is in verbose mode. If it is, it resets the 
<code class="literal">HoldExpensive</CODE
> (<code class="literal">c</CODE
>) option 

(see <a class="xref" href="ch34_08.htm" title="">Section 34.8.29</A
>)
to false and sets the 
<code class="literal">DeliveryMode</CODE
> (<code class="literal">d</CODE
>) option (see <a class="xref" href="ch34_08.htm" title="">Section 34.8.16</A
>)
to interactive.</P
><p class="para">The <code class="literal">-v</CODE
> switch is most useful for watching SMTP mail being sent and
for producing expanded output when viewing the queue.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-42">36.7.42 -X</A
></H3
><p class="refpurpose">Log transactions</P
>(V8.1 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53133"></A
><a class="indexterm" name="AUTOID-53135"></A
>The <code class="literal">-X</CODE
> command line switch tells <em class="emphasis">sendmail</EM
> to open
the file whose name is the next following argument and to append 
to that file both sides of all SMTP transactions.
The <code class="literal">-X</CODE
> command-line switch is described in full
in <a class="xref" href="ch26_04.htm" title="Log Transactions with -X">Section 26.4</A
>.</P
></DIV
></BLOCKQUOTE
></DIV
><div class="refentry"><div class="refnamediv"><h3 class="refname"><a class="refname" name="SML2-CH-36-SECT-7-43">36.7.43 -x</A
></H3
><p class="refpurpose">Ignored</P
>(V8.2 and above)</DIV
><blockquote><div class="refsect1"><p class="para"><a class="indexterm" name="AUTOID-53149"></A
><a class="indexterm" name="AUTOID-53151"></A
><a class="indexterm" name="AUTOID-53153"></A
><a class="indexterm" name="AUTOID-53156"></A
>V8 <em class="emphasis">sendmail</EM
> prints an error if an illegal switch is specified (whereas
other versions of <em class="emphasis">sendmail</EM
> silently ignore them). The <em class="emphasis">mailx</EM
>
program supplied with OSF/1 from DEC and AIX from IBM
issues an illegal <code class="literal">-x</CODE
> switch. To keep <em class="emphasis">sendmail</EM
> from uselessly
complaining under OSF/1 and AIX, that switch is specifically ignored.
To get the same behavior with AIX under V8.1 <em class="emphasis">sendmail</EM
>,
look for <code class="literal">_osf_</CODE
> in <em class="emphasis">main.c</EM
>
and uncomment the code necessary to ignore that switch.</P
></DIV
></BLOCKQUOTE
></DIV
></DIV
><div class="htmlnav"><p></P
><hr align="LEFT" width="515" title="footer"><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="ch36_06.htm" title="36.6 Pitfalls"><img src="../gifs/txtpreva.gif" alt="Previous: 36.6 Pitfalls" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><a class="book" href="index.htm" title="sendmail"><img src="../gifs/txthome.gif" alt="sendmail" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="CHAPTER" href="ch37_01.htm" title="37. Debugging with -d"><img src="../gifs/txtnexta.gif" alt="Next: 37. Debugging with -d" border="0"></A
></TD
></TR
><tr><td align="LEFT" valign="TOP" width="172">36.6 Pitfalls</TD
><td align="CENTER" valign="TOP" width="171"><a class="index" href="index/idx_0.htm" title="Book Index"><img src="../gifs/index.gif" alt="Book Index" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172">37. Debugging with -d</TD
></TR
></TABLE
><hr align="LEFT" width="515" title="footer"><p class="nav"><font size="-1">[ <a href="../index.htm" title="The Networking CD Bookshelf">Library Home</A
> | <a href="../dnsbind/index.htm" title="DNS &amp; BIND">DNS &amp; BIND</A
> | <a href="../tcpip/index.htm" title="TCP/IP Network Administration">TCP/IP</A
> | <a href="index.htm" title="sendmail">sendmail</A
> | <a href="../smdref/index.htm" title="sendmail Desktop Reference">sendmail Reference</A
> | <a href="../firewall/index.htm" title="Building Internet Firewalls">Firewalls</A
> | <a href="../puis/index.htm" title="Practical UNIX &amp; Internet Security">Practical Security</A
> ]</FONT
></P
></DIV
></BODY
></HTML
>
