<html><head>
<title>[Chapter 13] 13.3 Potential Problem List</TITLE>
<meta name="DC.title" content="DNS &amp; BIND"><meta name="DC.creator" content="Cricket Liu &amp; Paul Albitz"><meta name="DC.publisher" content="O'Reilly &amp; Associates, Inc."><meta name="DC.date" content="1999-01-06T18:39:08Z"><meta name="DC.type" content="Text.Monograph"><meta name="DC.format" content="text/html" scheme="MIME"><meta name="DC.source" content="1-56592-512-2" scheme="ISBN"><meta name="DC.language" content="en-US"><meta name="generator" content="Jade 1.1/O'Reilly DocBook 3.0 to HTML 4.0"><link rev="made" href="mailto:online-books@oreilly.com" title="Online Books Comments"><link rel="up" href="ch13_01.htm" title="13. Troubleshooting DNS and BIND"><link rel="prev" href="ch13_02.htm#AUTOID-13515" title="13.2 Troubleshooting Tools and Techniques"><link rel="next" href="ch13_04.htm" title="13.4 Transition Problems"></HEAD
><body bgcolor="#FFFFFF" text="#000000"><div class="htmlnav"><h1><img src="gifs/smbanner.gif" alt="DNS &amp; BIND" usemap="#srchmap" border="0"></H1
><map name=index.html"srchmap"><area shape="RECT" coords="0,0,466,65" href="index.htm" alt="DNS &amp; BIND"><area shape="RECT" coords="467,0,514,18" href="../search/dsrch.htm" alt="Search this book"></MAP
><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="ch13_02.htm#AUTOID-13515" title="13.2 Troubleshooting Tools and Techniques"><img src="../gifs/txtpreva.gif" alt="Previous: 13.2 Troubleshooting Tools and Techniques" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><b><font face="ARIEL,HELVETICA,HELV,SANSERIF" size="-1">Chapter 13<br>Troubleshooting <span class="acronym">DNS</SPAN
> and
<span class="acronym">BIND</SPAN
></FONT
></B
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="SECT1" href="ch13_04.htm" title="13.4 Transition Problems"><img src="../gifs/txtnexta.gif" alt="Next: 13.4 Transition Problems" border="0"></A
></TD
></TR
></TABLE
>&nbsp;<hr align="LEFT" width="515" title="footer"></DIV
><div class="SECT1"><h2 class="sect1"><a class="title" name="AUTOID-13652">13.3 Potential Problem List</A
></H2
><p class="para"><a class="indexterm" name="CH13.PROBLEMS"></A
>Now
that we've given you a nice set of tools, let's talk about how you
can use them to diagnose real problems. There are some problems
that are easy to recognize and correct. We should cover these as
a matter of course&nbsp;- they're some of the most common problems because
they're caused by some of the most common mistakes. Here are the
contestants, in no particular order. We call 'em our <span class="quote">"Unlucky Thirteen."</SPAN
></P
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13659">13.3.1 1. Forgot to Increment Serial Number</A
></H3
><p class="para"><a class="indexterm" name="CH13.SERIAL"></A
><a class="indexterm" name="AUTOID-13665"></A
>The main symptom
of this problem is that slave name servers don't pick up any changes
you make to the zone's db file on the primary. The slaves think
the zone data hasn't changed, since the serial number is still the same.</P
><p class="para">How do you check whether or not you remembered to increment
the serial number? Unfortunately, that's not so easy. If you don't
remember what the old serial number was, and your serial number
gives you no indication of when it was updated, there's no direct
way to tell whether it's changed.[1] When you signal the
primary, it will load the updated zone file regardless of whether you've
changed the serial number. It will check the file's timestamp,
see that it's been modified since it last loaded the data, and read
the file. About the best you can do is to use <kbd class="command">nslookup</KBD
> to
compare the data returned by the primary and by a slave. If they return
different data, you probably forgot to increment the serial number.
If you can remember a recent change you made, you can look for that
data. If you can't remember a recent change, you could try transferring
the zone from a primary and from a slave, sorting the results, and
using <kbd class="command">diff</KBD
> to compare them.</P
><blockquote class="footnote"><p class="para">[1]  On the other hand,
if you encode the date into the serial number, as many people do
(e.g., 1998010500 is the first rev of data on January 5, 1998),
you may be able to tell at a glance whether you updated the serial number
when you made the change.</P
></BLOCKQUOTE
><p class="para">The
good news is that, although determining whether the zone was transferred
is tricky, making sure the zone is transferred is simple. Just increment
the serial number on the primary's copy of the db file and signal
the primary to reload. The slaves should pick up the new data within their
refresh interval, or sooner if they use <span class="acronym">NOTIFY</SPAN
>. If you want to make
sure the slaves can transfer the new data, you can execute <kbd class="command">named-xfer</KBD
> by
hand (on the slaves, naturally):</P
><blockquote class="screen"><pre class="screen"># <code class="userinput"><b>/etc/named-xfer -z movie.edu -f db.movie -s 0 terminator</B
></CODE
>
# <code class="userinput"><b>echo $?</B
></CODE
></PRE
></BLOCKQUOTE
><p class="para">If <kbd class="command">named-xfer</KBD
> returns 1, the zone was
transferred successfully. Other return values indicate that no zone
was transferred, either because of an error or because the slave
thought the zone was up-to-date. (See <a class="xref" href="ch13_02.htm#AUTOID-13515" title="How to Use named-xfer">Section 13.2.1, "How to Use named-xfer</A
>,&quot;
earlier in this chapter, for more details.)</P
><p class="para">There's another variation on the <span class="quote">"forgot to increment the
serial number"</SPAN
> line. We see it in environments where administrators
use tools like <kbd class="command">h2n</KBD
> to create db files from
the host table. With scripts like<a class="indexterm" name="AUTOID-13685"></A
>
<kbd class="command">h2n</KBD
>, it's temptingly easy to delete old db
files and create new ones from scratch. Some administrators do this
occasionally because they mistakenly believe that data in the old
db files can creep into the new ones. The problem with deleting
the db files is that, without the old db file to read for the current
serial number, <kbd class="command">h2n</KBD
> starts over at serial number
1. If your primary's serial number rolls all the way back to 1 from
598 or what-have-you, the slaves (versions 4.8.3 and earlier) don't
complain; they just figure they're all caught up and don't need
zone transfers. A 4.9 or later slave server, however, is ever watchful, and
will emit a syslog error message warning you that something might
be wrong:</P
><blockquote class="screen"><pre class="screen">Jun  7 20:14:26 wormhole named[29618]: Zone &quot;movie.edu&quot;
                (class 1) <span class="acronym">SOA</SPAN
> serial# (1) rcvd from [192.249.249.3]
                is &lt; ours (112)</PRE
></BLOCKQUOTE
><p class="para">So if the serial number on the primary looks suspiciously low,
check the serial number on the slaves, too, and compare them:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>set q=soa</B
></CODE
>
&gt; <code class="userinput"><b>movie.edu.</B
></CODE
>
Server:  terminator.movie.edu
Address:  192.249.249.3

movie.edu
        origin = terminator.movie.edu
        mail addr = al.robocop.movie.edu
        serial = 1
        refresh = 10800 (3 hours)
        retry   = 3600 (1 hour)
        expire  = 604800 (7 days)
        minimum ttl = 86400 (1 day)
&gt; <code class="userinput"><b>server wormhole.movie.edu.</B
></CODE
>
Default Server:  wormhole.movie.edu
Addresses:  192.249.249.1, 192.253.253.1

&gt; <code class="userinput"><b>movie.edu.</B
></CODE
>
Server:  wormhole.movie.edu
Addresses:  192.249.249.1, 192.253.253.1

movie.edu
        origin = terminator.movie.edu
        mail addr = al.robocop.movie.edu
        serial = 112
        refresh = 10800 (3 hours)
        retry   = 3600 (1 hour)
        expire  = 604800 (7 days)
        minimum ttl = 86400 (1 day)</PRE
></BLOCKQUOTE
><p class="para"><i class="systemitem.sitename">wormhole</I
>, as a <i class="systemitem.sitename">movie.edu</I
> slave,
should never have a larger serial number than the primary master,
so clearly something's amiss.</P
><p class="para">This problem is really
easy to spot, by the way, with the tool we'll write in <a class="xref" href="ch14_01.htm" title="Programming with the Resolver and Name Server Library Routines">Chapter 14, <cite class="chapter">Programming with the Resolver and Name Server Library
Routines</CITE
></A
>, coming up next.</P
><a class="indexterm" name="AUTOID-13703"></A
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13704">13.3.2 2. Forgot to Signal Primary Master Server</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-13707"></A
><a class="indexterm" name="AUTOID-13710"></A
>Occasionally, you may forget to
signal your primary master name server after making a change to
the conf file or to the db file. The name server won't know to load
the new data&nbsp;- it doesn't automatically check the timestamp of the
file and notice that it changed. Consequently, any changes you've made
won't be reflected in the name server's data: new zones won't be
loaded, and new records won't percolate out to the slaves.</P
><p class="para">To
check when you last signaled the name server to reload, scan the <kbd class="command">syslog</KBD
> output
for the last entry like this:</P
><blockquote class="screen"><pre class="screen">Mar  8 17:22:08 terminator named[22317]: reloading nameserver<a class="indexterm" name="AUTOID-13716"></A
></PRE
></BLOCKQUOTE
><p class="para">This is the last time you sent a <span class="acronym">HUP</SPAN
> signal to the
name server. If you killed and then restarted the name server, you'll
see an entry like this:</P
><blockquote class="screen"><pre class="screen">Mar  8 17:22:08 terminator named[22317]: restarted<a class="indexterm" name="AUTOID-13721"></A
></PRE
></BLOCKQUOTE
><p class="para">or, on a 4.9 name server:</P
><blockquote class="screen"><pre class="screen">Mar  8 17:22:08 terminator named[22317]: starting</PRE
></BLOCKQUOTE
><p class="para">If the time of the restart doesn't correlate with
the time you made the last change, signal the name server to reload
its data again. And check that you incremented the serial numbers
on db files you changed, too.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13726">13.3.3 3. Slave Server Can't Load Zone Data</A
></H3
><p class="para"><a class="indexterm" name="CH13.LOADZONE1"></A
><a class="indexterm" name="CH13.LOADZONE2"></A
>If a slave name server can't get
the current serial number for a zone from its master name server,
it'll log a message like the following via <kbd class="command">syslog</KBD
>:</P
><blockquote class="screen"><pre class="screen">Jan  6 11:55:25 wormhole named[544]: Err/<span class="acronym">TO</SPAN
> getting serial# for &quot;movie.edu&quot;</PRE
></BLOCKQUOTE
><p class="para">On a <span class="acronym">BIND</SPAN
> 4 name server, that looks like this:</P
><blockquote class="screen"><pre class="screen">Mar  3 8:19:34 wormhole named[22261]: zoneref: Masters for secondary
       zone movie.edu unreachable</PRE
></BLOCKQUOTE
><p class="para">If you let this problem fester, the slave will expire
the zone:</P
><blockquote class="screen"><pre class="screen">Mar  8 17:12:43 wormhole named[22261]: secondary zone
       &quot;movie.edu&quot; expired</PRE
></BLOCKQUOTE
><p class="para">Once the zone has expired, you'll start getting<a class="indexterm" name="AUTOID-13744"></A
>
<span class="acronym">SERVFAIL</SPAN
> errors when you query the name
server for data in the zone:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup robocop wormhole.movie.edu.</B
></CODE
>
Server:  wormhole.movie.edu
Addresses:  192.249.249.1, 192.253.253.1

*** wormhole.movie.edu can't find robocop.movie.edu: Server failed</PRE
></BLOCKQUOTE
><p class="para">There are three leading causes of this problem: a
loss in<a class="indexterm" name="AUTOID-13750"></A
>
connectivity
to the master server due to network failure, an incorrect <span class="acronym">IP</SPAN
> address
for the master server in the conf file, and a syntax error in the
zone data file on the master server. First check the conf file's
entry for the zone and see what <span class="acronym">IP</SPAN
> address the slave is attempting
to load from:</P
><blockquote class="screen"><pre class="screen">zone &quot;movie.edu&quot; {
                type slave;
                file &quot;db.movie&quot;;
                masters { 192.249.249.3; };
};</PRE
></BLOCKQUOTE
><p class="para">On a <span class="acronym">BIND</SPAN
> 4 server, the directive would look like this:</P
><blockquote class="screen"><pre class="screen">secondary        movie.edu        192.249.249.3        db.movie</PRE
></BLOCKQUOTE
><p class="para">Make sure that's really the <span class="acronym">IP</SPAN
> address of the master
name server. If it is, check connectivity to that <span class="acronym">IP</SPAN
> address:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>ping 192.249.249.3 -n 10</B
></CODE
>
<span class="acronym">PING</SPAN
> 192.249.249.3: 64 byte packets

----192.249.249.3 <span class="acronym">PING</SPAN
> Statistics----
10 packets transmitted, 0 packets received, 100% packet loss</PRE
></BLOCKQUOTE
><p class="para">If the master server isn't reachable, make sure that
the server's host is really running (e.g., is powered on, etc.), or
look for a network problem. If the server is reachable, make sure <kbd class="command">named</KBD
> is
running on the host, and that you can manually transfer the zone:</P
><blockquote class="screen"><pre class="screen"># <code class="userinput"><b>named-xfer -z movie.edu -f /tmp/db.movie -s 0 192.249.249.3</B
></CODE
>
# <code class="userinput"><b>echo $?</B
></CODE
>
2</PRE
></BLOCKQUOTE
><p class="para">A return code of 2 means that an error occurred.
Check to see if there is a <kbd class="command">syslog</KBD
> message.
In this case there was a message:</P
><blockquote class="screen"><pre class="screen">Jan  6 14:56:07 zardoz named-xfer[695]: record too short from [192.249.249.3], zone movie.edu</PRE
></BLOCKQUOTE
><p class="para">At first glance, this error looks like a truncation
problem. The real problem is easier to see if you use <kbd class="command">nslookup</KBD
>:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup - terminator.movie.edu</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>ls movie.edu</B
></CODE
>                  <i class="lineannotation">--This attempts a zone transfer</I
>
[terminator.movie.edu]
*** Can't list domain movie.edu: Query refused</PRE
></BLOCKQUOTE
><p class="para">What has happened here is that <kbd class="command">named</KBD
> is
refusing to allow you to transfer its zone data. The remote server
has secured its zone data with the <em class="emphasis">allow-transfer</EM
> substatement,
the <i class="structfield">secure_zone</I
> resource record, or <i class="structfield">xfrnets</I
> boot
file directive.</P
><p class="para">If the master server is responding as
not authoritative for the zone, you'll see a message like this:</P
><blockquote class="screen"><pre class="screen">Jan  6 11:58:36 zardoz named[544]: Err/<span class="acronym">TO</SPAN
> getting serial# for &quot;movie.edu&quot;
Jan  6 11:58:36 zardoz named-xfer[793]: [192.249.249.3] not authoritative for
     movie.edu, <span class="acronym">SOA</SPAN
> query got rcode 0, aa 0, ancount 0, aucount 0</PRE
></BLOCKQUOTE
><p class="para">If this is the correct master server, the server
<em class="emphasis">should</EM
> be authoritative for the zone.  This probably indicates that the
master had a problem loading the zone, usually because of a syntax
error in the zone data file.  Contact the administrator of the master
server and have him check his syslog output for indications of a
syntax error (see problem 5, later in this chapter).</P
><a class="indexterm" name="AUTOID-13790"></A
><a class="indexterm" name="AUTOID-13791"></A
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13792">13.3.4 4. Added Name to Database File, but Forgot to Add <span class="acronym">PTR</SPAN
>
Record</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-13796"></A
><a class="indexterm" name="AUTOID-13799"></A
><a class="indexterm" name="AUTOID-13802"></A
><a class="indexterm" name="AUTOID-13805"></A
><a class="indexterm" name="AUTOID-13808"></A
>Because
the mappings from host names to <span class="acronym">IP</SPAN
> addresses are disjointed from
the mappings from <span class="acronym">IP</SPAN
> addresses to host names in <span class="acronym">DNS</SPAN
>, it's easy to
forget to add a <span class="acronym">PTR</SPAN
> record for a new host. Adding the A record is
intuitive, but many people who are used to host tables assume that
adding an address record takes care of the reverse mapping, too.
That's not true&nbsp;- you need to add a <span class="acronym">PTR</SPAN
> record for the host to the
appropriate <i class="systemitem.sitename">in-addr.arpa</I
> domain.</P
><p class="para">Forgetting
to add the <span class="acronym">PTR</SPAN
> record for a host usually causes that host to fail
authentication checks. For example, users on the host won't be able
to <kbd class="command">rlogin</KBD
> to other hosts without specifying
a password, and <kbd class="command">rsh</KBD
> or <kbd class="command">rcp</KBD
> to
other hosts simply won't work. The servers these commands talk to
need to be able to map the connection's <span class="acronym">IP</SPAN
> address to a domain name
to check <i class="filename">.rhosts</I
> and <i class="filename">hosts.equiv</I
>.
These users' connections will cause entries like this to be <kbd class="command">syslog</KBD
>ged:</P
><blockquote class="screen"><pre class="screen">Aug 15 17:32:36 terminator inetd[23194]: login/tcp:
       Connection from unknown (192.249.249.23)</PRE
></BLOCKQUOTE
><p class="para"><a class="indexterm" name="AUTOID-13828"></A
>Also, many large <kbd class="command">ftp</KBD
> archives,
including <i class="systemitem.sitename">ftp.uu.net</I
>, refuse anonymous <kbd class="command">ftp</KBD
> access
to hosts whose <span class="acronym">IP</SPAN
> addresses don't map back to domain names. <i class="systemitem.sitename">ftp.uu.net</I
>'s <kbd class="command">ftp</KBD
> server
emits a message that reads, in part:</P
><blockquote class="screen"><pre class="screen">530- Sorry, we're unable to map your <span class="acronym">IP</SPAN
> address 140.186.66.1 to a hostname
530- in the <span class="acronym">DNS</SPAN
>.  This is probably because your nameserver does not have a
530- <span class="acronym">PTR</SPAN
> record for your address in its tables, or because your reverse
530- nameservers are not registered.  We refuse service to hosts whose
530- names we cannot resolve.</PRE
></BLOCKQUOTE
><p class="para">That makes the reason you can't use anonymous <kbd class="command">ftp</KBD
> pretty
evident. Other <kbd class="command">ftp</KBD
> sites, however, don't bother
printing informative messages; they simply deny service.</P
><p class="para"><kbd class="command">nslookup</KBD
> is
handy for checking whether you've forgotten the <span class="acronym">PTR</SPAN
> record or not:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>beetlejuice</B
></CODE
>      <i class="lineannotation">--Check for a hostname-to-address mapping</I
>
Server:  terminator.movie.edu
Address:  192.249.249.3

Name:    beetlejuice.movie.edu
Address:  192.249.249.23

&gt; <code class="userinput"><b>192.249.249.23</B
></CODE
>  <i class="lineannotation">--Now check for a corresponding address-to-hostname mapping</I
>
Server:  terminator.movie.edu
Address:  192.249.249.3

*** terminator.movie.edu can't find 192.249.249.23: Non-existent domain</PRE
></BLOCKQUOTE
><p class="para">On the primary for <i class="systemitem.sitename">249.249.192.in-addr.arpa</I
>,
a quick check of the <i class="filename">db.192.249.249</I
> file will
tell you if the <span class="acronym">PTR</SPAN
> record hasn't been added to the db file yet,
or if the name server hasn't been signaled to load the file. If
the name server having trouble is a slave for the zone, check that
the serial number was incremented on the primary and that the slave
has had enough time to load the zone.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13856">13.3.5 5. Syntax Error in the Conf File or <span class="acronym">DNS</SPAN
> Database File</A
></H3
><p class="para"><a class="indexterm" name="CH13.SYNTAX1"></A
><a class="indexterm" name="CH13.SYNTAX2"></A
><a class="indexterm" name="CH13.SYNTAX3"></A
><a class="indexterm" name="CH13.SYNTAX4"></A
>Syntax errors in the conf file and
in zone database files are also relatively common (more or less,
depending on the experience of the administrator). Generally, an
error in the conf file will cause the name server to fail to load
one or more zones. Some typos in the <i class="structfield">options</I
> statement
will cause the name server to fail to start at all, and to log an
error like this via <kbd class="command">syslog</KBD
>:</P
><blockquote class="screen"><pre class="screen">Jan  6 11:59:29 terminator named[544]: can't change directory to /var/name: No
     such file or directory</PRE
></BLOCKQUOTE
><p class="para">Note that you won't see an error message when you
try to start <kbd class="command">named</KBD
> on the command line, but <kbd class="command">named</KBD
> won't
stay running for long.</P
><p class="para">If the syntax error is in a less
important line in the boot file&nbsp;- say, in <i class="structfield">zone</I
> statement&nbsp;- only
that zone will be affected. Usually, the name server will not be
able to load the zone at all (say, you misspell <span class="quote">"master"</SPAN
> or the
name of the data file, or you forget to put quotes around the file name
or domain name). This would produce <kbd class="command">syslog</KBD
> output
like:</P
><blockquote class="screen"><pre class="screen">Jan  6 12:01:36 terminator named[841]: /etc/named.conf:10: syntax error near
     'movie.edu'</PRE
></BLOCKQUOTE
><p class="para">If a db file contains a syntax error, yet the name
server succeeds in loading the zone, it will either answer as <span class="quote">"non-authoritative"</SPAN
>
for <em class="emphasis">all</EM
> data in the zone or will return a <span class="acronym">SERVFAIL</SPAN
>
error for lookups in the zone:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup carrie</B
></CODE
>
Server:  terminator.movie.edu
Address:  192.249.249.3

Non-authoritative answer:
Name:    carrie.movie.edu
Address:  192.253.253.4</PRE
></BLOCKQUOTE
><p class="para">Here's the <kbd class="command">syslog</KBD
> message produced
by the syntax error that caused this problem:</P
><blockquote class="screen"><pre class="screen">Jan  6 15:07:46 huskymo named[693]: db.movie:11: Priority error
     (postmanrings2x.movie.edu.)
Jan  6 15:07:46 huskymo named[693]: master zone &quot;movie.edu&quot; (<span class="acronym">IN</SPAN
>) rejected due
     to errors (serial 1997010600)
Jan  6 15:07:46 huskymo named[693]: slave zone &quot;movie.edu&quot; (<span class="acronym">IN</SPAN
>) removed</PRE
></BLOCKQUOTE
><p class="para">If you looked in the db file for the problem, you'd
find this record:</P
><blockquote class="screen"><pre class="screen">postmanrings2x     IN     MX     postmanrings2x.movie.edu.</PRE
></BLOCKQUOTE
><p class="para">The <span class="acronym">MX</SPAN
> record is missing the preference field, which
causes the error.</P
><p class="para">Note that unless you correlate the
lack of authority (when you expect the name server to be authoritative)
with a problem, or scan your <kbd class="command">syslog</KBD
> file assiduously,
you might never notice the syntax error!</P
><p class="para">Starting with <span class="acronym">BIND</SPAN
>
4.9.4, an <span class="quote">"invalid"</SPAN
> host name can be a syntax error:</P
><blockquote class="screen"><pre class="screen">Jan  6 12:04:10 terminator named[841]: owner name &quot;<span class="acronym">ID</SPAN
>_4.movie.edu&quot; <span class="acronym">IN</SPAN
> (primary)
     is invalid - rejecting
Jan  6 12:04:10 terminator named[841]: db.movie:11: owner name error
Jan  6 12:04:10 terminator named[841]: db.movie:11: Database error (a)
Jan  6 12:04:10 terminator named[841]: master zone &quot;movie.edu&quot; (<span class="acronym">IN</SPAN
>) rejected
     due to errors (serial 1997010600)</PRE
></BLOCKQUOTE
><a class="indexterm" name="AUTOID-13906"></A
><a class="indexterm" name="AUTOID-13907"></A
><a class="indexterm" name="AUTOID-13908"></A
><a class="indexterm" name="AUTOID-13909"></A
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13910">13.3.6 6. Missing Dot at the End of a Name in a <span class="acronym">DNS</SPAN
> Database
File</A
></H3
><p class="para">It's <em class="emphasis">very</EM
> easy to leave off<a class="indexterm" name="AUTOID-13915"></A
><a class="indexterm" name="AUTOID-13918"></A
><a class="indexterm" name="AUTOID-13920"></A
><a class="indexterm" name="AUTOID-13923"></A
>
trailing
dots when editing a db file. Since the rules for when to use them
change so often (<em class="emphasis">don't</EM
> use them in the boot
file, <em class="emphasis">don't</EM
> use them in <i class="filename">resolv.conf</I
>,
<em class="emphasis">do</EM
> use them in db files to override $<span class="acronym">ORIGIN</SPAN
>...),
it's hard to keep them straight. These resource records:</P
><blockquote class="screen"><pre class="screen">zorba         IN     MX     10 zelig.movie.edu
movie.edu     IN     NS     terminator.movie.edu</PRE
></BLOCKQUOTE
><p class="para">really don't look that odd to the untrained eye,
but they probably don't do what they're intended to. In the <i class="filename">db.movie</I
> file,
they'd be equivalent to:</P
><blockquote class="screen"><pre class="screen">zorba.movie.edu.        IN    MX    10 zelig.movie.edu.movie.edu.
movie.edu.movie.edu.    IN    NS    terminator.movie.edu.movie.edu.</PRE
></BLOCKQUOTE
><p class="para">unless the origin were explicitly changed.</P
><p class="para">If
you omit a trailing dot after a domain name in the resource record's
data (as opposed to leaving off a trailing dot in the resource record's <i class="filename">name</I
>), you
usually end up with wacky <span class="acronym">NS</SPAN
> or <span class="acronym">MX</SPAN
> records:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup -type=mx zorba.movie.edu.</B
></CODE
>
Server:  terminator.movie.edu
Address:  192.249.249.3

zorba.movie.edu      preference = 10, mail exchanger
                     = zelig.movie.edu.movie.edu
zorba.movie.edu      preference = 50, mail exchanger
                     = postmanrings2x.movie.edu.movie.edu</PRE
></BLOCKQUOTE
><p class="para">The cause of this should be fairly clear from the <kbd class="command">nslookup</KBD
> output.
But if you forget the trailing dot on the domain name field in a
record (as in the <i class="systemitem.sitename">movie.edu</I
> <span class="acronym">NS</SPAN
> record above),
spotting your mistake might not be as easy. If you try to look up
the record with <kbd class="command">nslookup</KBD
>, you won't find it
under the name you thought you used. Dumping your name server's
database may help you root it out:</P
><blockquote class="screen"><pre class="screen">$<span class="acronym">ORIGIN</SPAN
> edu.movie.edu.
movie    <span class="acronym">IN</SPAN
>    <span class="acronym">NS</SPAN
>    terminator.movie.edu.movie.edu.</PRE
></BLOCKQUOTE
><p class="para">The <code class="literal">$ORIGIN</CODE
> line looks odd enough to stand out.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13953">13.3.7 7. Missing Cache Data</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-13956"></A
><a class="indexterm" name="AUTOID-13959"></A
>If, for some reason, you forget to install
a cache file on your host, or if you accidentally delete it, your
name server will be unable to resolve names outside of its authoritative
data. This behavior is easy to recognize using <kbd class="command">nslookup</KBD
>,
but be careful to use full, dot-terminated domain names, or else
the search list may cause misleading failures.</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>ftp.uu.net.</B
></CODE
>    <i class="lineannotation">&nbsp;- A lookup of a name outside your name server's authoritative data</I
>
                                        <i class="lineannotation">&nbsp;- causes a SERVFAIL error...</I
>
Server:  terminator.movie.edu
Address:  192.249.249.3

*** terminator.movie.edu can't find ftp.uu.net.: Server failed&#13;</PRE
></BLOCKQUOTE
><p class="para">A lookup of a name in your name server's authoritative
data returns a response:</P
><blockquote class="screen"><pre class="screen">&gt; <code class="userinput"><b>wormhole.movie.edu.</B
></CODE
>
Server:  terminator.movie.edu
Address:  192.249.249.3

Name:    wormhole.movie.edu
Addresses:  192.249.249.1, 192.253.253.1

&gt; <code class="userinput"><b>^D</B
></CODE
></PRE
></BLOCKQUOTE
><p class="para">To confirm your suspicion that the cache data are
missing, check the <em class="emphasis">syslog</EM
> output for an error
like this:</P
><blockquote class="screen"><pre class="screen"> Jan  6 15:10:22 terminator named[764]: No root nameservers for class <span class="acronym">IN</SPAN
></PRE
></BLOCKQUOTE
><p class="para">Class 1, you'll remember, is the <span class="acronym">IN</SPAN
>, or Internet,
class. This error indicates that because no cache data were available,
no root name servers were found.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-13978">13.3.8 8. Loss of Network Connectivity</A
></H3
><p class="para"><a class="indexterm" name="CH13.CONNECT1"></A
><a class="indexterm" name="CH13.CONNECT2"></A
><a class="indexterm" name="AUTOID-13987"></A
>Though
the Internet is more reliable today than it was back in the wild
and woolly days of the <span class="acronym">ARPANET</SPAN
>, network outages are still relatively
common. Without <span class="quote">"lifting the hood"</SPAN
> and poking around in debugging
output, these failures usually look like poor performance:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup nisc.sri.com.</B
></CODE
>
Server:  terminator.movie.edu
Address:  192.249.249.3

*** Request to terminator.movie.edu timed out ***</PRE
></BLOCKQUOTE
><p class="para">If you turn on name server debugging, though, you'll
see that your name server, anyway, is healthy. It received
the query from the resolver, sent the necessary queries, and waited
patiently for a response. It just didn't get
one. Here's what the debugging output might look like:</P
><blockquote class="screen"><pre class="screen">Debug turned <span class="acronym">ON</SPAN
>, Level 1</PRE
></BLOCKQUOTE
><p class="para">Here <kbd class="command">nslookup</KBD
> sends the first query to our
local name server, for the <span class="acronym">IP</SPAN
> address of
<i class="systemitem.sitename">nisc.sri.com</I
>. You can tell
it's not another name server because the query is received from a port
other than 53, the name server's port. Notice that the query is
forwarded to another name server, and when no answer is received, it
is resent to a different name server:</P
><blockquote class="screen"><pre class="screen">datagram from [192.249.249.3].1051, fd 5, len 30
req: nlookup(nisc.sri.com) id 18470 type=1 class=1
req: missed 'nisc.sri.com' as 'com' (cname=0)
forw: forw -&gt; [198.41.0.4].53 ds=7 nsid=58732 id=18470 0ms retry 4 sec
resend(addr=1 n=0) -&gt; [128.9.0.107].53 ds=7 nsid=58732 id=18470 0ms</PRE
></BLOCKQUOTE
><p class="para">Now <kbd class="command">nslookup</KBD
> is getting impatient, and it queries
our local name server again. Notice that it uses the same port. The
local name server ignores the duplicate query and tries forwarding the
query two more times:</P
><blockquote class="screen"><pre class="screen">datagram from [192.249.249.3].1051, fd 5, len 30
req: nlookup(nisc.sri.com) id 18470 type=1 class=1
req: missed 'nisc.sri.com' as 'com' (cname=0)
resend(addr=2 n=0) -&gt; [192.33.4.12].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=3 n=0) -&gt; [128.8.10.90].53 ds=7 nsid=58732 id=18470 0ms</PRE
></BLOCKQUOTE
><p class="para"><kbd class="command">nslookup</KBD
> queries the local name server again, and the name server fires off more queries:</P
><blockquote class="screen"><pre class="screen">datagram from [192.249.249.3].1051, fd 5, len 30
req: nlookup(nisc.sri.com) id 18470 type=1 class=1
req: missed 'nisc.sri.com' as 'com' (cname=0)
resend(addr=4 n=0) -&gt; [192.203.230.10].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=0 n=1) -&gt; [198.41.0.4].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=1 n=1) -&gt; [128.9.0.107].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=2 n=1) -&gt; [192.33.4.12].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=3 n=1) -&gt; [128.8.10.90].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=4 n=1) -&gt; [192.203.230.10].53 ds=7 nsid=58732 id=18470 0ms
resend(addr=0 n=2) -&gt; [198.41.0.4].53 ds=7 nsid=58732 id=18470 0ms
Debug turned OFF</PRE
></BLOCKQUOTE
><p class="para">From the debugging output, you can extract a list
of the <span class="acronym">IP</SPAN
> addresses of the name servers that your name server tried
to query, and then check your connectivity to them. Odds are, <em class="emphasis">ping</EM
> won't
have much better luck than your name server did:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>ping 198.41.0.4 -n 10</B
></CODE
> <i class="lineannotation">--ping first name server queried</I
>
<span class="acronym">PING</SPAN
> 198.41.0.4: 64 byte packets

----198.41.0.4 <span class="acronym">PING</SPAN
> Statistics----
10 packets transmitted, 0 packets received, 100% packet loss
% <code class="userinput"><b>ping 128.9.0.107 -n 10</B
></CODE
> <i class="lineannotation">--ping second name server queried</I
>
<span class="acronym">PING</SPAN
> 128.9.0.107: 64 byte packets

----128.9.0.107 <span class="acronym">PING</SPAN
> Statistics----
10 packets transmitted, 0 packets received, 100% packet loss</PRE
></BLOCKQUOTE
><p class="para">If it does, you should check that the remote name servers are
really running. You might also check whether your Internet firewall is
inadvertently blocking your name server's queries. If you've upgraded
to <span class="acronym">BIND</SPAN
> 8 recently, see <a class="xref" href="ch15_04.htm#AUTOID-17264" title="A Gotcha with BIND 8 and Packet Filtering Firewalls">the sidebar "A Gotcha with <span class="acronym">BIND</SPAN
> 8 and Packet Filtering
Firewalls"</A
>, and see if it applies to you.</P
><p class="para">If <em class="emphasis">ping</EM
> can't get
through, either, all that's left to do is to locate the break in
the network. Utilities like <em class="emphasis">traceroute</EM
> and <em class="emphasis">ping</EM
>'s
record route option can be very helpful in determining whether the
problem is on your network, the destination network, or somewhere
in the middle.</P
><p class="para">You should also use your own common sense
when tracking down the break. In this trace, for example, the remote
name servers your name server tried to query are all root name servers.
(You might have had their <span class="acronym">PTR</SPAN
> records cached somewhere, so you could
find out their domain names.) Now it's not very likely that each
root's local network went down, nor is it likely that the Internet's
commercial backbone networks collapsed entirely. Occam's razor says
that the simplest condition that could cause this behavior&nbsp;- namely,
the loss of <em class="emphasis">your</EM
> network's link to the Internet&nbsp;- is
the most likely cause.</P
><a class="indexterm" name="AUTOID-14030"></A
><a class="indexterm" name="AUTOID-14031"></A
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-14032">13.3.9 9. Missing Subdomain Delegation</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-14035"></A
><a class="indexterm" name="AUTOID-14038"></A
><a class="indexterm" name="CH13.SUBDOMAIN1"></A
><a class="indexterm" name="CH13.SUBDOMAIN2"></A
><a class="indexterm" name="CH13.SUBDOMAIN3"></A
><a class="indexterm" name="CH13.SUBDOMAIN4"></A
>Even
though the Inter<span class="acronym">NIC</SPAN
> does its best to process your requests as quickly
as possible, it may take a day or two for your domain's delegation
to appear in the root name servers. If the Inter<span class="acronym">NIC</SPAN
> doesn't manage
your parent domain, your mileage may vary. Some parents are quick
and responsible, others are slow and inconsistent. Just like in
real life, though, you're stuck with them.[2]</P
><blockquote class="footnote"><p class="para">[2] Until the <span class="acronym">GTLD</SPAN
> Memorandum of Understanding is adopted,
that is.  See <a class="systemitem.url" href="../../../../../../../www.gtld-mou.org/">http://www.gtld-mou.org/</A
>.</P
></BLOCKQUOTE
><p class="para">Until
your delegation data appear in your parent domain's name servers,
your name servers will be able to look up data in the Internet domain
name space, but no one else on the Internet (outside of your domain)
will know how to look up data in <em class="emphasis">your</EM
> name space.</P
><p class="para">That means that even though you can send mail outside of your
domain, the recipients won't be able to reply to it. Furthermore,
no one will be able to <em class="emphasis">telnet</EM
> to, <em class="emphasis">ftp</EM
> to,
or even <em class="emphasis">ping</EM
> your hosts by name.</P
><p class="para">Remember
that this applies equally to any <em class="emphasis">in-addr.arpa</EM
> subdomains
you may run.  Until the parent delegates those subdomains to your
servers, name servers on the Internet won't be able to reverse map
addresses on your networks.</P
><p class="para">To determine whether or not your zone's delegation has made it into your
parent zone's name servers, query a parent name server for the <span class="acronym">NS</SPAN
>
records for your zone. If the parent name server has the data, any
name server on the Internet can find it:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>server a.root-servers.net.</B
></CODE
> <i class="lineannotation">--Query a root name server</I
>
Default Server:  a.root-servers.net
Address:  198.41.0.4

&gt; <code class="userinput"><b>set norecurse</B
></CODE
>             <i class="lineannotation">&nbsp;- Instruct the server to answer out of its own data</I
>
&gt; <code class="userinput"><b>set type=ns</B
></CODE
>               <i class="lineannotation">&nbsp;- and to look for NS records</I
>
&gt; <code class="userinput"><b>249.249.192.in-addr.arpa.</B
></CODE
> <i class="lineannotation">&nbsp;- for 249.249.192.in-addr.arpa</I
>
Server:  a.root-servers.net
Address:  198.41.0.4

*** a.root-servers.net can't find 249.249.192.in-addr.arpa.: Non-existent domain</PRE
></BLOCKQUOTE
><p class="para">Here, the delegation clearly hasn't been added yet.
You can either wait patiently, or if an unreasonable amount of time
has passed since you requested delegation from your parent, contact
your parent and ask what's up.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-14079">13.3.10 10. Incorrect Subdomain Delegation</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-14082"></A
><a class="indexterm" name="AUTOID-14085"></A
>Incorrect subdomain delegation
is another familiar problem on the Internet. Keeping delegation
up to date requires human intervention&nbsp;- informing your parent zone's
administrator of changes to your set of authoritative name servers.
Consequently, delegation information often becomes inaccurate as administrators
make changes without letting their parents know. Far too many administrators
believe that setting up delegation is a one-shot deal: they let
their parents know which name servers are authoritative once, when
they set up their zone, and then they never talk to them again.
They don't even call on Mother's Day.</P
><p class="para">An administrator
may add a new name server, decommission another, and change the
<span class="acronym">IP</SPAN
> address of a third, all without telling the parent zone's administrator.
Gradually, the number of name servers correctly delegated to by
the parent zone dwindles. In the best case, this leads to long resolution
times, as querying name servers struggle to find an authoritative
name server for the zone. If the delegation information becomes
badly out of date, and the last authoritative name server host is
brought down for maintenance, the information within the zone will
be inaccessible.</P
><p class="para">If you suspect bad delegation from your
parent to your zone, from your zone to one of your children, or
from a remote zone to one of its children, you can check with <em class="emphasis">nslookup</EM
>:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>server a.root-servers.net.</B
></CODE
>     <i class="lineannotation">&nbsp;- Set server to the parent name server you suspect</I
>
                                                        <i class="lineannotation">has bad delegation</I
>
Default Server:  a.root-servers.net
Address:  198.41.0.4

&gt; <code class="userinput"><b>set type=ns</B
></CODE
>                    <i class="lineannotation">&nbsp;- Look for NS records</I
>
&gt; <code class="userinput"><b>hp.com.</B
></CODE
>                        <i class="lineannotation">&nbsp;- for the zone in question</I
>
Server:  a.root-servers.net
Address:  198.41.0.4

Non-authoritative answer:
hp.com          nameserver = <span class="acronym">RELAY</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
hp.com          nameserver = <span class="acronym">HPLABS</SPAN
>.<span class="acronym">HPL</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
hp.com          nameserver = <span class="acronym">NNSC</SPAN
>.<span class="acronym">NSF</SPAN
>.<span class="acronym">NET</SPAN
>
hp.com          nameserver = <span class="acronym">HPSDLO</SPAN
>.<span class="acronym">SDD</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>

Authoritative answers can be found from:
hp.com          nameserver = <span class="acronym">RELAY</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
hp.com          nameserver = <span class="acronym">HPLABS</SPAN
>.<span class="acronym">HPL</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
hp.com          nameserver = <span class="acronym">NNSC</SPAN
>.<span class="acronym">NSF</SPAN
>.<span class="acronym">NET</SPAN
>
hp.com          nameserver = <span class="acronym">HPSDLO</SPAN
>.<span class="acronym">SDD</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
<span class="acronym">RELAY</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>    internet address = 15.255.152.2
<span class="acronym">HPLABS</SPAN
>.<span class="acronym">HPL</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>       internet address = 15.255.176.47
<span class="acronym">NNSC</SPAN
>.<span class="acronym">NSF</SPAN
>.<span class="acronym">NET</SPAN
>    internet address = 128.89.1.178
<span class="acronym">HPSDLO</SPAN
>.<span class="acronym">SDD</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>       internet address = 15.255.160.64
<span class="acronym">HPSDLO</SPAN
>.<span class="acronym">SDD</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>       internet address = 15.26.112.11</PRE
></BLOCKQUOTE
><p class="para">Let's say you suspect that the delegation to <i class="systemitem.sitename">hpsdlo.sdd.hp.com</I
> is incorrect. You now
query <i class="systemitem.sitename">hpsdlo</I
> for data in the
<i class="systemitem.sitename">hp.com</I
> zone and check the
answer:</P
><blockquote class="screen"><pre class="screen">&gt; <code class="userinput"><b>server hpsdlo.sdd.hp.com.</B
></CODE
>
Default Server:  hpsdlo.sdd.hp.com
Addresses:  15.255.160.64, 15.26.112.11

&gt; <code class="userinput"><b>set norecurse</B
></CODE
>
&gt; <code class="userinput"><b>set type=soa</B
></CODE
>
&gt; <code class="userinput"><b>hp.com.</B
></CODE
>
Server:  hpsdlo.sdd.hp.com
Addresses:  15.255.160.64, 15.26.112.11

Non-authoritative answer:
hp.com
        origin = relay.hp.com
        mail addr = hostmaster.hp.com
        serial = 1001462
        refresh = 21600 (6 hours)
        retry   = 3600 (1 hour)
        expire  = 604800 (7 days)
        minimum ttl = 86400 (1 day)

Authoritative answers can be found from:
hp.com          nameserver = <span class="acronym">RELAY</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
hp.com          nameserver = <span class="acronym">HPLABS</SPAN
>.<span class="acronym">HPL</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>
hp.com          nameserver = <span class="acronym">NNSC</SPAN
>.<span class="acronym">NSF</SPAN
>.<span class="acronym">NET</SPAN
>
<span class="acronym">RELAY</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>    internet address = 15.255.152.2
<span class="acronym">HPLABS</SPAN
>.<span class="acronym">HPL</SPAN
>.<span class="acronym">HP</SPAN
>.<span class="acronym">COM</SPAN
>       internet address = 15.255.176.47
<span class="acronym">NNSC</SPAN
>.<span class="acronym">NSF</SPAN
>.<span class="acronym">NET</SPAN
>    internet address = 128.89.1.178</PRE
></BLOCKQUOTE
><p class="para">If <em class="emphasis">hpsdlo</EM
> really were authoritative, it
would have responded with an authoritative answer. The administrator
of the <em class="emphasis">hp.com</EM
> zone can tell you whether <em class="emphasis">hpsdlo</EM
> should
be an authoritative name server for <em class="emphasis">hp.com</EM
>,
so that's who you should contact.</P
><p class="para"><a class="indexterm" name="AUTOID-14182"></A
>Another common
symptom of this is a <span class="quote">"lame server"</SPAN
> error message:</P
><blockquote class="screen"><pre class="screen">Oct 1 04:43:38 terminator named[146]: Lame server on '40.234.23.210.in-addr.arpa' (in '210.in-addr.arpa'?): [198.41.0.5].53 '<span class="acronym">RS</SPAN
>0.<span class="acronym">INTERNIC</SPAN
>.<span class="acronym">NET</SPAN
>': learnt(A=198.41.0.21,<span class="acronym">NS</SPAN
>=128.63.2.53)</PRE
></BLOCKQUOTE
><p class="para">Here's how to read that: your name server was referred
by the name server at 128.63.2.53 to the name server at 198.41.0.5
for a name in the domain <i class="systemitem.sitename">210.in-addr.arpa</I
>
specifically <i class="systemitem.sitename">40.234.23.210.in-addr.arpa</I
>.  The server at 198.41.0.5's
response indicated that it wasn't, in fact, authoritative for <i class="systemitem.sitename">210.in-addr.arpa</I
>,
and therefore either the delegation that 128.63.2.53 gave you is
wrong or the server at 198.41.0.5 is misconfigured.</P
><a class="indexterm" name="AUTOID-14194"></A
><a class="indexterm" name="AUTOID-14195"></A
><a class="indexterm" name="AUTOID-14196"></A
><a class="indexterm" name="AUTOID-14197"></A
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-14198">13.3.11 11. Syntax Error in resolv.conf</A
></H3
><p class="para">Despite
the<a class="indexterm" name="AUTOID-14201"></A
><a class="indexterm" name="AUTOID-14204"></A
><a class="indexterm" name="AUTOID-14207"></A
>
<em class="emphasis">resolv.conf</EM
> file's
simple syntax, people do occasionally make mistakes when editing
it. And, unfortunately, lines with syntax errors in <em class="emphasis">resolv.conf</EM
> are
silently ignored by the resolver. The result is usually that some part
of your intended configuration doesn't take effect: either your
domain or search list isn't set correctly, or the resolver won't
query one of the name servers you configured it to query. Commands
that rely on the search list won't work, your resolver won't
query the right name server(s), or it won't query a name server
at all.</P
><p class="para">The easiest way to check whether your <i class="filename">resolv.conf</I
>
file is having the intended effect is to run <kbd class="command">nslookup</KBD
>. <kbd class="command">nslookup</KBD
>
will kindly report the default domain and search list it derives from
<i class="filename">resolv.conf</I
>, plus the name server it's querying, when you type <code class="literal">set
all</CODE
>, as we showed you in <a class="xref" href="ch11_01.htm" title="nslookup">Chapter 11, <cite class="chapter">nslookup</CITE
></A
>:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>set all</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

Set options:
  nodebug         defname          search         recurse
  nod2            novc             noignoretc     port=53
  querytype=A     class=<span class="acronym">IN</SPAN
>         timeout=5      retry=4
  root=ns.nic.ddn.mil.
  domain=movie.edu
  srchlist=movie.edu

&gt;</PRE
></BLOCKQUOTE
><p class="para">Check that the output of<a class="indexterm" name="AUTOID-14224"></A
>
<em class="emphasis">set all</EM
> is
what you expect, given your <em class="emphasis">resolv.conf</EM
> file.
For example, if you'd set search <i class="systemitem.sitename">fx.movie.edu</I
> <i class="systemitem.sitename">movie.edu</I
> in <em class="emphasis">resolv.conf</EM
>,
you'd expect to see:</P
><blockquote class="screen"><pre class="screen">domain=fx.movie.edu
srchlist=fx.movie.edu/movie.edu</PRE
></BLOCKQUOTE
><p class="para">in the output. If you don't see what you're expecting,
look carefully at <em class="emphasis">resolv.conf</EM
>. If you don't
see anything obvious, look for nonprinting characters (with <em class="emphasis">vi</EM
>'s <em class="emphasis">set
list</EM
> command, for example). Watch out for trailing spaces, especially;
a trailing space after the domain name will set the default domain
to include a space. No real domain names actually end with spaces,
so all of your non-dot-terminated lookups will fail.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-14236">13.3.12 12. Default Domain Not Set</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-14239"></A
><a class="indexterm" name="AUTOID-14242"></A
>Failing
to set your default domain is another old standby gaffe. You can
set it implicitly, by setting your <em class="emphasis">hostname</EM
> to
your host's fully qualified domain name, or explicitly, in <em class="emphasis">resolv.conf</EM
>.
The characteristics of an unset default domain are straightforward:
folks who use single-label names (or abbreviated domain names) in
commands get no joy:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>telnet br</B
></CODE
>
br: No address associated with name
% <code class="userinput"><b>telnet br.fx</B
></CODE
>
br.fx: No address associated with name
% <code class="userinput"><b>telnet br.fx.movie.edu</B
></CODE
>
Trying...
Connected to bladerunner.fx.movie.edu.
Escape character is '^]'.

<span class="acronym">HP-UX</SPAN
> bladerunner.fx.movie.edu A.08.07 A 9000/730 (ttys1)
login:</PRE
></BLOCKQUOTE
><p class="para">You can use <em class="emphasis">nslookup</EM
> to check
this one, much as you do when you suspect a syntax error in <em class="emphasis">resolv.conf</EM
>:</P
><blockquote class="screen"><pre class="screen">% <code class="userinput"><b>nslookup</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

&gt; <code class="userinput"><b>set all</B
></CODE
>
Default Server:  terminator.movie.edu
Address:  192.249.249.3

Set options:
  nodebug         defname         search          recurse
  nod2            novc            noignoretc      port=53
  querytype=A     class=<span class="acronym">IN</SPAN
>        timeout=5       retry=4
  root=ns.nic.ddn.mil.
  domain=
  srchlist=</PRE
></BLOCKQUOTE
><p class="para">Notice that neither the local domain nor the search list
is set. You can also track this down by enabling debugging on the
name server. (This, of course, requires access to the name server,
which may not be running on the host the problem's affecting.) Here's
how the debugging output might look after trying those <em class="emphasis">telnet</EM
> commands:</P
><blockquote class="screen"><pre class="screen">Debug turned <span class="acronym">ON</SPAN
>, Level 1

datagram from [192.249.249.3].1057, fd 5, len 20
req: nlookup(br) id 27974 type=1 class=1
req: missed 'br' as '' (cname=0)
forw: forw -&gt; [198.41.0.4].53 ds=7 nsid=61691 id=27974 0ms retry 4 sec

datagram from [198.41.0.4].53, fd 5, len 20
ncache: dname br, type 1, class 1
send_msg -&gt; [192.249.249.3].1057 (<span class="acronym">UDP</SPAN
> 5) id=27974

datagram from [192.249.249.3].1059, fd 5, len 23
req: nlookup(br.fx) id 27975 type=1 class=1
req: missed 'br.fx' as '' (cname=0)
forw: forw -&gt; [128.9.0.107].53 ds=7 nsid=61692 id=27975 0ms retry 4 sec

datagram from [128.9.0.107].53, fd 5, len 23
ncache: dname br.fx, type 1, class 1
send_msg -&gt; [192.249.249.3].1059 (<span class="acronym">UDP</SPAN
> 5) id=27975

datagram from [192.249.249.3].1060, fd 5, len 33
req: nlookup(br.fx.movie.edu) id 27976 type=1 class=1
req: found 'br.fx.movie.edu' as 'br.fx.movie.edu' (cname=0)
req: nlookup(bladerunner.fx.movie.edu) id 27976 type=1 class=1
req: found 'bladerunner.fx.movie.edu' as 'bladerunner.fx.movie.edu'
     (cname=1)
ns_req: answer -&gt; [192.249.249.3].1060 fd=5 id=27976 size=183 Local
Debug turned OFF</PRE
></BLOCKQUOTE
><p class="para">Contrast this with the debugging output produced by the
application of the search list in <a class="xref" href="ch12_01.htm" title="Reading BIND Debugging Output">Chapter 12</A
>. The
only names looked up here are exactly what the user typed, with no
domains appended at all. Clearly the search list isn't being
applied.</P
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="AUTOID-14267">13.3.13 13. Response from Unexpected Source</A
></H3
><p class="para"><a class="indexterm" name="AUTOID-14270"></A
>One
problem we've seen increasingly often in the <span class="acronym">DNS</SPAN
> newsgroups is the
<span class="quote">"response from unexpected source."</SPAN
>  This was once called a Martian
response:  it's a response that comes from an <span class="acronym">IP</SPAN
> address other than
the one your server sent a query to.  When a <span class="acronym">BIND</SPAN
> name server sends
a query to a remote server, <span class="acronym">BIND</SPAN
> conscientiously makes sure that
answers come only from the <span class="acronym">IP</SPAN
> addresses on that server.  This helps
minimize the possibility of accepting spoofed responses.  <span class="acronym">BIND</SPAN
>
is equally demanding of itself:  a <span class="acronym">BIND</SPAN
> server makes every effort
to reply via the same network interface that it received a query
on.</P
><p class="para">Here's the error message you'd see upon receiving
a possibly unsolicited response:</P
><blockquote class="screen"><pre class="screen">Mar  8 17:21:04 terminator named[235]: Response from unexpected source ([205.199.4.131].53)</PRE
></BLOCKQUOTE
><p class="para">This can mean one of two things: either someone
is trying to spoof your name server, or&nbsp;- more likely&nbsp;- you sent a query
to an older <span class="acronym">BIND</SPAN
> server or a different make of name server that's
not as assiduous about replying from the same interface it receives
queries on.</P
></DIV
><a class="indexterm" name="AUTOID-14285"></A
></DIV
><div class="htmlnav"><p></P
><hr align="LEFT" width="515" title="footer"><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="ch13_02.htm#AUTOID-13515" title="13.2 Troubleshooting Tools and Techniques"><img src="../gifs/txtpreva.gif" alt="Previous: 13.2 Troubleshooting Tools and Techniques" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><a class="book" href="index.htm" title="DNS &amp; BIND"><img src="../gifs/txthome.gif" alt="DNS &amp; BIND" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="SECT1" href="ch13_04.htm" title="13.4 Transition Problems"><img src="../gifs/txtnexta.gif" alt="Next: 13.4 Transition Problems" border="0"></A
></TD
></TR
><tr><td align="LEFT" valign="TOP" width="172">13.2 Troubleshooting Tools and Techniques</TD
><td align="CENTER" valign="TOP" width="171"><a class="index" href="index/idx_0.htm" title="Book Index"><img src="../gifs/index.gif" alt="Book Index" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172">13.4 Transition Problems</TD
></TR
></TABLE
><hr align="LEFT" width="515" title="footer"><p class="nav"><font size="-1">[ <a href="../index.htm" title="The Networking CD Bookshelf">Library Home</A
> | <a href="index.htm" title="DNS &amp; BIND">DNS &amp; BIND</A
> | <a href="../tcpip/index.htm" title="TCP/IP Network Administration">TCP/IP</A
> | <a href="../sendmail/index.htm" title="sendmail">sendmail</A
> | <a href="../smdref/index.htm" title="sendmail Desktop Reference">sendmail Reference</A
> | <a href="../firewall/index.htm" title="Building Internet Firewalls">Firewalls</A
> | <a href="../puis/index.htm" title="Practical UNIX &amp; Internet Security">Practical Security</A
> ]</FONT
></P
></DIV
></BODY
></HTML
>
