<html><head>
<title>[Appendix C] C.2 named.boot Configuration Commands</TITLE>
<meta name="DC.title" content="TCP/IP Network Administration"><meta name="DC.creator" content="Craig Hunt"><meta name="DC.publisher" content="O'Reilly &amp; Associates, Inc."><meta name="DC.date" content="1999-02-04T01:43:34Z"><meta name="DC.type" content="Text.Monograph"><meta name="DC.format" content="text/html" scheme="MIME"><meta name="DC.source" content="1-56592-322-7" scheme="ISBN"><meta name="DC.language" content="en-US"><meta name="generator" content="Jade 1.1/O'Reilly DocBook 3.0 to HTML 4.0"><link rev="made" href="mailto:online-books@oreilly.com" title="Online Books Comments"><link rel="up" href="appc_01.htm" title="C. A named Reference"><link rel="prev" href="appc_01.htm" title="C.1 The named Command"><link rel="next" href="appc_03.htm#TCP2-AP-3-SECT-3.1" title="C.3 Zone File Records"></HEAD
><body bgcolor="#FFFFFF" text="#000000"><div class="htmlnav"><h1><img src="gifs/smbanner.gif" alt="TCP/IP Network Administration" usemap="#srchmap" border="0"></H1
><map name=index.html"srchmap"><area shape="RECT" coords="0,0,466,65" href="index.htm" alt="TCP/IP Network Administration"><area shape="RECT" coords="467,0,514,18" href="../search/tsrch.htm" alt="Search this book"></MAP
><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="appc_01.htm" title="C.1 The named Command"><img src="../gifs/txtpreva.gif" alt="Previous: C.1 The named Command" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><b><font face="ARIEL,HELVETICA,HELV,SANSERIF" size="-1">Appendix C<br>A named Reference</FONT
></B
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="SECT1" href="appc_03.htm#TCP2-AP-3-SECT-3.1" title="C.3 Zone File Records"><img src="../gifs/txtnexta.gif" alt="Next: C.3 Zone File Records" border="0"></A
></TD
></TR
></TABLE
>&nbsp;<hr align="LEFT" width="515" title="footer"></DIV
><div class="SECT1"><h2 class="sect1"><a class="title" name="TCP2-AP-3-SECT-2">C.2 named.boot Configuration Commands</A
></H2
><p class="para"><a class="indexterm" name="TCP2-AP-3-IX-NAMED-BOOT-FILE-CONFIGURATION-COMMANDS"></A
>The <em class="emphasis">/etc/named.boot</EM
> file defines the name server configuration and
tells <b class="emphasis.bold">named</B
> where to obtain the name server database
information. <em class="emphasis">named.boot</EM
> contains the following types of
records:</P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">directory</B
> <code class="replaceable"><i>directory-path</I
></CODE
></DT
><dd class="listitem"><p class="para">Defines a default directory used for all subsequent file references
anywhere in the <b class="emphasis.bold">named</B
> configuration. If <b class="emphasis.bold">named</B
> is forced to
dump memory, the memory dump is stored in this directory.</P
></DD
><dt class="term"><b class="emphasis.bold">primary</B
> <code class="replaceable"><i>domain-name file-name</I
></CODE
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-24157"></A
>Declares the local name server as the primary master server for the
domain specified by <code class="replaceable"><i>domain-name</I
></CODE
>. As a primary server, the system
loads the name server database from the local disk file specified by
<code class="replaceable"><i>name</I
></CODE
> in the <code class="replaceable"><i>file-name</I
></CODE
> field.</P
></DD
><dt class="term"><b class="emphasis.bold">secondary</B
> <code class="replaceable"><i>domain-name server-address-list file-name</I
></CODE
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-24168"></A
>Makes the local server a secondary master server for the domain identified
by <code class="replaceable"><i>domain-name</I
></CODE
>. The <code class="replaceable"><i>server-address-list</I
></CODE
> contains the IP
address of at least one other master server for this domain. Multiple
addresses can be provided in the list, but at least the primary server's
address should be provided. The local server will try each server in
the list until it successfully loads the name server database. The local
server transfers the entire domain database and stores all of the data it
receives in a local file identified by <code class="replaceable"><i>file-name</I
></CODE
>. After completing
the transfer, the local server answers all queries for information about
the domain with complete authority.</P
></DD
><dt class="term"><b class="emphasis.bold">cache .</B
> <code class="replaceable"><i>file-name</I
></CODE
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-24179"></A
>The <b class="emphasis.bold">cache</B
> command points to the file used to initialize the name server
cache with a list of root servers. This command starts with the keyword
<b class="emphasis.bold">cache</B
>, followed by the name of the root domain (.), and ends with
the name of the file that contains the root server list. This file can
have any name you wish, but it is usually called <em class="emphasis">named.ca</EM
>,
<em class="emphasis">named.root</EM
>, or <em class="emphasis">root.cache</EM
>. The <b class="emphasis.bold">cache</B
> command is included in
every <em class="emphasis">named.boot</EM
> file. <b class="emphasis.bold">named</B
> needs the list of root
servers as a starting point from which to locate all other DNS
domains.</P
></DD
><dt class="term"><b class="emphasis.bold">forwarders</B
> <code class="replaceable"><i>server-address server-address ...</I
></CODE
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-24196"></A
>The <b class="emphasis.bold">forwarders</B
> command provides <b class="emphasis.bold">named</B
> with a list of
servers to try if it can't resolve a query from its own cache. In the
syntax shown, <code class="replaceable"><i>server-address</I
></CODE
> is the IP address of a server on
your network that can perform a recursive name server query for the
local host. (A recursive query
[2]
means that the remote server pursues
the answer to the query, even if it does not have the answer itself,
and returns the answer to the originator.) The servers listed on the
<b class="emphasis.bold">forwarders</B
> command line (the servers are also called
&quot;forwarders&quot;) are tried in order until one responds to the query. The
listed servers develop an extensive cache that benefits every host
that uses them.  Because of this, their use is often recommended. If
you plan to use <b class="emphasis.bold">forwarders</B
>, your network administrator should
define the list of forwarders for your network. The forwarders only
develop a rich cache if they are used by several hosts.&#13;</P
><blockquote class="footnote"><p class="para">[2] <a class="xref" href="ch03_01.htm" title="Network Services">Chapter 3, <cite class="chapter">Network Services</CITE
></A
>, discusses recursive and nonrecursive name server
queries.</P
></BLOCKQUOTE
></DD
><dt class="term"><b class="emphasis.bold">slave</B
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-24211"></A
>The <b class="emphasis.bold">slave</B
> command forces the local server to use only the
servers listed on the forwarders command line. The slave command can
only be used if a <b class="emphasis.bold">forwarders</B
> command is also present in the
<em class="emphasis">named.boot</EM
> file. A server that has a <b class="emphasis.bold">slave</B
> command in its
<em class="emphasis">named.boot</EM
> file is called a <em class="emphasis">slave server</EM
>. A slave server
does not attempt to contact the authoritative servers for a domain,
even if the forwarding servers do not respond to its query. Regardless
of the circumstances, a slave server queries only the forwarders. The
<b class="emphasis.bold">slave</B
> command is used when limited network access makes the
forwarders the only servers that can be reached by the local host. The
<b class="emphasis.bold">slave</B
> command is not used on systems that have full Internet
access because it limits their flexibility.</P
></DD
><dt class="term"><b class="emphasis.bold">sortlist</B
> <code class="replaceable"><i>network network ...</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">sortlist</B
> command causes <b class="emphasis.bold">named</B
> to prefer addresses from
the listed networks over addresses from other networks. Normally, DNS
sorts the addresses in a response only if the host issuing the query
and the name server share a network. In that case, the shared network
is the preferred network.</P
></DD
><dt class="term"><b class="emphasis.bold">xfrnets</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">&amp;</B
><code class="replaceable"><i>mask] ...</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">xfrnets</B
> command limits zone transfers to hosts with the specified
<code class="replaceable"><i>address</I
></CODE
>. The <code class="replaceable"><i>address</I
></CODE
> is written in dotted decimal notation
and is intepreted as a network address. The optional mask field
is used to change the interpretation of the <code class="replaceable"><i>address</I
></CODE
>. When a bit
is on in the mask field, that bit is significant for determining which
hosts will be allowed to receive a zone file transfer. For example,
<b class="emphasis.bold">xfrnets 172.16.0.0</B
> allows every host on network 172.16 to do zone
file transfers, while <b class="emphasis.bold">xfrnets 172.16.12.3&amp;255.255.255.255</B
> limits
zone file transfers to the single host 172.16.12.3.</P
><p class="para">For security reasons, many sites do not want to let everyone list
all of the hostnames in their domain. <b class="emphasis.bold">xfrnets</B
> limits the ability to
retrieve your entire domain to specific, trusted hosts. <b class="emphasis.bold">tcplist</B
> is
an alternative form of this command maintained for compatibility with
older server implementations.</P
></DD
><dt class="term"><b class="emphasis.bold">include</B
> <code class="replaceable"><i>file</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">include</B
> command includes the contents of <code class="replaceable"><i>file</I
></CODE
> at the location
that the command appears in the boot file. This command can be used
for very large configurations that are maintained by different  people.</P
></DD
><dt class="term"><b class="emphasis.bold">bogusns</B
> <code class="replaceable"><i>address address ...</I
></CODE
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-24260"></A
>The <b class="emphasis.bold">bogusns</B
> command prevents queries from being sent to the name server
specified by <code class="replaceable"><i>address</I
></CODE
>. <code class="replaceable"><i>address</I
></CODE
> must be an IP address, not
a domain name. This command is used to avoid cache contamination when
you know that a remote name server is providing incorrect informatiom.
<b class="emphasis.bold">bogusns</B
> is only a temporary fix placed in the boot file until the remote
domain administrator has a chance to fix the real problem.</P
></DD
><dt class="term"><b class="emphasis.bold">limit</B
> <code class="replaceable"><i>name value</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">limit</B
> command changes BIND's internal quotas. <code class="replaceable"><i>value</I
></CODE
>
is a number that specifies the new quota setting. <b class="emphasis.bold">k</B
>, <b class="emphasis.bold">m</B
>, or
<b class="emphasis.bold">g</B
>, for kilobytes, megabytes, and gigabytes, respectively, can be
appended to the new quota value number as appropriate. <code class="replaceable"><i>name</I
></CODE
> is
the name of the quota being set. There are four possible values for
<code class="replaceable"><i>name</I
></CODE
>: <b class="emphasis.bold">datasize</B
> sets the process data size quota;
[3]
<b class="emphasis.bold">transfers-in</B
> sets the number of named transfer subprocesses that BIND
may spawn at any one time; <b class="emphasis.bold">transfers-per-ns</B
> sets the maximum number
of simultaneous zone transfers allowed to any one remote nameserver.
There can be multiple limit commands in a boot file&nbsp;- one for each quota
that is being set.</P
><blockquote class="footnote"><p class="para">[3] This is a kernel quota and therefore can be set only on systems that
provide a kernel call to implement this.</P
></BLOCKQUOTE
></DD
><dt class="term"><b class="emphasis.bold">options</B
> <code class="replaceable"><i>option option ...</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">options</B
> command enables optional features of BIND. The <code class="replaceable"><i>option</I
></CODE
>
keywords are Booleans. Specifying an <code class="replaceable"><i>option</I
></CODE
> on the command line
turns on the optional behavior. By default, the optional features
are turned off. Valid <code class="replaceable"><i>option</I
></CODE
> values are: <b class="emphasis.bold">query-log</B
>&nbsp;- logs all
queries via syslogd, which produces a very large amount of log
data. <b class="emphasis.bold">forward-only</B
>&nbsp;- all queries are to be sent to the forwarders;
this is exactly the same as the <b class="emphasis.bold">slave</B
> command, though this syntax is now
preferred over the <b class="emphasis.bold">slave</B
> syntax. <b class="emphasis.bold">fake-iquery</B
>&nbsp;- the nameserver
responds to inverse
queries with a fake reply rather than an error; used if you have some
clients that cannot properly handle the error. <b class="emphasis.bold">no-recursion</B
>&nbsp;- the
name server answers a query for data only in a zone for which it
is authoritative; all other queries are answered with a referral to
another server. <b class="emphasis.bold">no-fetch-glue</B
>&nbsp;- the<a class="indexterm" name="AUTOID-24301"></A
>
nameserver does not fetch missing glue records for a query response;
the resulting response could be incomplete; it is
used with <b class="emphasis.bold">no-recursion</B
> to limit cache growth and reduce the
chance of cache corruption.</P
></DD
><dt class="term"><b class="emphasis.bold">check-names</B
> <code class="replaceable"><i>source action</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">check-names</B
> command tells the name server to check host
names against the standards for hostnames defined in RFC 952, and to
check non-hostname responses to make sure that they contain nothing
but printable characters.  The <code class="replaceable"><i>source</I
></CODE
> is the source of the
hostname or string data that is being checked. The <code class="replaceable"><i>source</I
></CODE
> can
be <b class="emphasis.bold">primary</B
> for the primary zone file; <b class="emphasis.bold">secondary</B
> for the
secondary zone file, or <b class="emphasis.bold">response</B
> for the message received during
recursive search. The <code class="replaceable"><i>action</I
></CODE
> tells the name server what to do
when an error is detected: <b class="emphasis.bold">fail</B
> (reject the data; do not load,
cache, or forward it); <b class="emphasis.bold">warn</B
> (send an error message to the system
log); or <b class="emphasis.bold">ignore</B
> (process the data as if no error occurred).
Multiple <b class="emphasis.bold">check-names</B
> commands can appear in a boot file; one for
each source of data. The action for each source can be different.</P
></DD
><dt class="term"><b class="emphasis.bold">max-fetch</B
> <code class="replaceable"><i>value</I
></CODE
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">max-fetch</B
> command performs exactly the same function as the
<b class="emphasis.bold">limit transfers-in command described previously. The </B
><b class="emphasis.bold">limit</B
>
command is now the preferred syntax.</P
></DD
></DL
><p class="para">At this writing, an experimental <em class="emphasis">named.boot</EM
> command is supported
in some configurations:</P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">stub</B
> <code class="replaceable"><i>domain-name server-address-list file-name</I
></CODE
></DT
><dd class="listitem"><p class="para">This command declares that this is a &quot;stub&quot; server for the domain specified
by <code class="replaceable"><i>domain-name</I
></CODE
>. The stub information is loaded from a server
specified in the <code class="replaceable"><i>server-address-list</I
></CODE
> and is stored in the file
identified by <code class="replaceable"><i>file-name</I
></CODE
>. The format of the <b class="emphasis.bold">stub</B
> command is
the same as the <b class="emphasis.bold">secondary</B
> command and the functions of the fields
in the command are the same. However, the <b class="emphasis.bold">stub</B
> command has very
limited applicability. It is only used on a primary host that is not
secondary for its subordinate domains. In that limited case, it is used
to ensure that the primary host has the correct NS records for its
subordinate domains.</P
></DD
></DL
><p class="para">There is a <em class="emphasis">named.boot</EM
> command that is no longer widely supported.
You'll occasionally encounter descriptions of it in material written
about name service, and for that reason it's discussed here. But don't
use it in your configurations. It is:</P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">domain</B
> <code class="replaceable"><i>name</I
></CODE
></DT
><dd class="listitem"><p class="para">This command functions in exactly the same way as the domain command used
in the <em class="emphasis">resolv.conf</EM
> file. It is an obsolete command and may not
be available in future releases of BIND. You don't need this command
because the default domain name is easily defined in <em class="emphasis">resolv.conf</EM
>.<a class="indexterm" name="AUTOID-24356"></A
></P
></DD
></DL
></DIV
><div class="htmlnav"><p></P
><hr align="LEFT" width="515" title="footer"><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="appc_01.htm" title="C.1 The named Command"><img src="../gifs/txtpreva.gif" alt="Previous: C.1 The named Command" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><a class="book" href="index.htm" title="TCP/IP Network Administration"><img src="../gifs/txthome.gif" alt="TCP/IP Network Administration" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="SECT1" href="appc_03.htm#TCP2-AP-3-SECT-3.1" title="C.3 Zone File Records"><img src="../gifs/txtnexta.gif" alt="Next: C.3 Zone File Records" border="0"></A
></TD
></TR
><tr><td align="LEFT" valign="TOP" width="172">C.1 The named Command</TD
><td align="CENTER" valign="TOP" width="171"><a class="index" href="index/idx_0.htm" title="Book Index"><img src="../gifs/index.gif" alt="Book Index" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172">C.3 Zone File Records</TD
></TR
></TABLE
><hr align="LEFT" width="515" title="footer"><p class="nav"><font size="-1">[ <a href="../index.htm" title="The Networking CD Bookshelf">Library Home</A
> | <a href="../dnsbind/index.htm" title="DNS &amp; BIND">DNS &amp; BIND</A
> | <a href="index.htm" title="TCP/IP Network Administration">TCP/IP</A
> | <a href="../sendmail/index.htm" title="sendmail">sendmail</A
> | <a href="../smdref/index.htm" title="sendmail Desktop Reference">sendmail Reference</A
> | <a href="../firewall/index.htm" title="Building Internet Firewalls">Firewalls</A
> | <a href="../puis/index.htm" title="Practical UNIX &amp; Internet Security">Practical Security</A
> ]</FONT
></P
></DIV
></BODY
></HTML
>
