<html><head>
<title>[Appendix D] D.3 The dhcpd.conf Configuration File</TITLE>
<meta name="DC.title" content="TCP/IP Network Administration"><meta name="DC.creator" content="Craig Hunt"><meta name="DC.publisher" content="O'Reilly &amp; Associates, Inc."><meta name="DC.date" content="1999-02-04T01:43:53Z"><meta name="DC.type" content="Text.Monograph"><meta name="DC.format" content="text/html" scheme="MIME"><meta name="DC.source" content="1-56592-322-7" scheme="ISBN"><meta name="DC.language" content="en-US"><meta name="generator" content="Jade 1.1/O'Reilly DocBook 3.0 to HTML 4.0"><link rev="made" href="mailto:online-books@oreilly.com" title="Online Books Comments"><link rel="up" href="appd_01.htm" title="D. A dhcpd Reference"><link rel="prev" href="appd_02.htm" title="D.2 The dhcpd Command"><link rel="next" href="appe_01.htm" title="E. A sendmail Reference"></HEAD
><body bgcolor="#FFFFFF" text="#000000"><div class="htmlnav"><h1><img src="gifs/smbanner.gif" alt="TCP/IP Network Administration" usemap="#srchmap" border="0"></H1
><map name=index.html"srchmap"><area shape="RECT" coords="0,0,466,65" href="index.htm" alt="TCP/IP Network Administration"><area shape="RECT" coords="467,0,514,18" href="../search/tsrch.htm" alt="Search this book"></MAP
><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="appd_02.htm" title="D.2 The dhcpd Command"><img src="../gifs/txtpreva.gif" alt="Previous: D.2 The dhcpd Command" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><b><font face="ARIEL,HELVETICA,HELV,SANSERIF" size="-1">Appendix D<br>A dhcpd Reference</FONT
></B
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="APPENDIX" href="appe_01.htm" title="E. A sendmail Reference"><img src="../gifs/txtnexta.gif" alt="Next: E. A sendmail Reference" border="0"></A
></TD
></TR
></TABLE
>&nbsp;<hr align="LEFT" width="515" title="footer"></DIV
><div class="SECT1"><h2 class="sect1"><a class="title" name="TCP2-AP-4-SECT-3">D.3 The dhcpd.conf Configuration File</A
></H2
><p class="para"><a class="indexterm" name="TCP2-AP-4-IX-DYNAMIC-HOST-CONFIGURATION-PROTOCOL-DHCP-DAEMON-DHCPD-CONFIGURING"></A
>When it starts, <b class="emphasis.bold">dhcpd</B
> reads its configuration from the
<em class="emphasis">/etc/dhcpd.conf</EM
> file. <em class="emphasis">dhcpd.conf</EM
> defines the network being
served by the DHCP server and the configuration information the server
provides to its clients.</P
><p class="para"><em class="emphasis">dhcpd.conf</EM
> is an ASCII text file. Comments in the file begin with a<a class="indexterm" name="AUTOID-25306"></A
><a class="indexterm" name="AUTOID-25308"></A
><a class="indexterm" name="AUTOID-25310"></A
><a class="indexterm" name="AUTOID-25312"></A
>
sharp sign (#). Keywords are case-insensitive. Whitespace can be used
to format the file. Related statements are enclosed in curly braces.<a class="indexterm" name="AUTOID-25314"></A
><a class="indexterm" name="AUTOID-25317"></A
><a class="indexterm" name="AUTOID-25320"></A
>
IP address can be entered as numeric addresses or as hostnames that
resolve to addresses.</P
><p class="para">Statements in the configuration file define the topology of the
network being served. In the documentation these statements are called
&quot;declarations&quot; because they declare something about the network
topology. The statements that define the topology are:
<b class="emphasis.bold">server-identifier</B
>, <b class="emphasis.bold">shared-network</B
>, <b class="emphasis.bold">subnet</B
>,
<b class="emphasis.bold">group</B
>, and <b class="emphasis.bold">host</B
>. When used, there is only one
server-identifier. All the other statements can appear multiple times
in the configuration file. The statements define a hierarchical
structure.  The <b class="emphasis.bold">shared-network</B
> contains subnets, and subnets can
contain hosts.</P
><p class="para">Parameters and options can be associated with each of these
statements.  Parameters define things about the server and the
protocol, such as the length of time for an address lease or where the
boot file is located. The options provide the clients with values for
the standard DHCP configuration options defined by the RFCs: for
example, whether the client should enable IP forwarding. Parameters
and options specified outside of a specific topology statement apply
to all networks served by this server. Those specified in the
<b class="emphasis.bold">group</B
> statement apply to all of the shared networks, subnets or
hosts grouped together by the statement.  The <b class="emphasis.bold">shared-network</B
>
statement options and parameters apply to all subnets on the shared
network. <b class="emphasis.bold">Subnet</B
> options and parameters apply to everything on
the subnet. <b class="emphasis.bold">Host</B
> options and parameters only apply to the
individual host. Options applied at a general level can be overridden
by the same option applied at a more specific level. <b class="emphasis.bold">Subnet</B
>
options override global options and <b class="emphasis.bold">host</B
>
options override <b class="emphasis.bold">subnet</B
> options. This structure allows the
network administrator to define configuration information for the
entire network and all of its parts.</P
><p class="para">In the following sections, we examine the syntax of all of the topology
statements and of all the parameters and options that can be associated
with them. We include many more parameters and options than you will ever
use, and there is no need to study them all. Use this reference to look
up the details of individual parameters and options when you need them.
See <a class="xref" href="ch09_01.htm" title="Configuring Network Servers ">Chapter 9</A
> for examples of how these statements, parameters, and
options are actually used in a real-world configuration.</P
><div class="sect2"><h3 class="sect2"><a class="title" name="TCP2-AP-4-SECT-3.1">D.3.1 Topology Statements</A
></H3
><p class="para"><a class="indexterm" name="TCP2-AP-4-IX-TOPOLOGY-STATEMENTS-IN-DHCPD"></A
></P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">server-identifier</B
> <code class="replaceable"><i>hostname</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">server-identifier</B
> statement documents the IP address of the server.
It is sometimes used at the start of the file as the first statement
of a group of parameter statements and option statements that apply
to every network served by this server. The documentation calls these
&quot;global parameters.&quot;</P
></DD
><dt class="term"><b class="emphasis.bold">group</B
> {[<code class="replaceable"><i>parameters</I
></CODE
>] [<code class="replaceable"><i>options</I
></CODE
>]<b class="emphasis.bold">}</B
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">group</B
> statement groups together <b class="emphasis.bold">shared-network</B
>, <b class="emphasis.bold">subnet</B
>,
<b class="emphasis.bold">host</B
>, or
other <b class="emphasis.bold">group</B
> statements to apply a set of parameters or options to all
members of the group.</P
></DD
><dt class="term"><b class="emphasis.bold">shared-network</B
> <code class="replaceable"><i>name</I
></CODE
> <b class="emphasis.bold">{</B
>[<code class="replaceable"><i>parameters</I
></CODE
>] [<code class="replaceable"><i>options</I
></CODE
>]<b class="emphasis.bold">}</B
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">shared-network</B
> statement is used only if more than one IP subnet
shares the same physical network. In most cases, different subnets are
on different physical networks. The <code class="replaceable"><i>name</I
></CODE
>, which must be provided,
can be any descriptive name. It is used only in debugging messages.
Parameters and options associated with the shared network are declared
within the curly braces and apply to all subnets in the shared network.
The subnets in a shared network must be defined within the curly braces
of the <b class="emphasis.bold">shared-network</B
> statement. It is assumed that each
<b class="emphasis.bold">shared-network</B
>
statement contains at least two subnet statements; otherwise there is no
need to use the <b class="emphasis.bold">shared-subnet</B
> statement. <b class="emphasis.bold">dhcpd</B
> cannot tell on which
subnet of a shared network a client should boot. Therefore, dynamically
allocated addresses are taken from the available range of all subnets
on the shared network and assigned as needed.</P
></DD
><dt class="term"><b class="emphasis.bold">subnet</B
> <code class="replaceable"><i>address</I
></CODE
> <b class="emphasis.bold">mask</B
> <code class="replaceable"><i>netmask</I
></CODE
> <b class="emphasis.bold">{</B
> [<code class="replaceable"><i>parameters</I
></CODE
>] [<code class="replaceable"><i>options</I
></CODE
>]<b class="emphasis.bold">}</B
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">subnet</B
> statement defines the IP address and address mask of
every subnet the daemon will serve. The address and mask are used to
identify the clients that belong to the subnet. The parameters and
options defined within the curly braces apply to every client on the
subnet.  Every subnet physically connected to the server must have a
<b class="emphasis.bold">subnet</B
> statement even if the subnet does not have any clients.</P
></DD
><dt class="term"><b class="emphasis.bold">host</B
> <code class="replaceable"><i>hostname</I
></CODE
> {[<code class="replaceable"><i>parameters</I
></CODE
>] [<code class="replaceable"><i>options</I
></CODE
>]<b class="emphasis.bold">}</B
></DT
><dd class="listitem"><p class="para">The <b class="emphasis.bold">host</B
> statement defines parameters and options for individual
clients.  Every BOOTP client must have a <b class="emphasis.bold">host</B
> statement in the
<em class="emphasis">dhcpd.conf</EM
> file. For DHCP clients, the <b class="emphasis.bold">host</B
> statement is
optional. It is matched to an actual DHCP or BOOTP clients by matching
the <b class="emphasis.bold">dhcp-client-identifier</B
> provided by the client or by matching
the hardware parameter to the hardware address of the client. BOOTP
clients do not provide a dhcp-client-identifier, so use the hardware
address for BOOTP clients. DHCP clients can be identified by either
the dhcp-client-identifier or the hardware address.<a class="indexterm" name="AUTOID-25411"></A
></P
></DD
></DL
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="TCP2-AP-4-SECT-3.2">D.3.2 Configuration Parameters</A
></H3
><p class="para"><a class="indexterm" name="TCP2-AP-4-IX-CONFIGURATION-PARAMETERS-IN-DHCPD"></A
>The parameter statements defined in this section control the operation of
the DHCP server and the DHCP protocol. The standard DHCP configuration
values that are passed to clients are defined in option statements,
which are covered in the next section. Some parameter statements can
be associated with any of the topology statements discussed above.
Others can only be used with specific statements. These are noted in
the description of the parameter.</P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">range</B
> [<b class="emphasis.bold">dynamic-bootp</B
>] <code class="replaceable"><i>low-address</I
></CODE
> [<code class="replaceable"><i>high-address</I
></CODE
>]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para"><a class="indexterm" name="AUTOID-25428"></A
>The <b class="emphasis.bold">range</B
> parameter defines the scope of addresses that are available
for dynamic assignment by defining the lowest and highest IP addresses
available for assignment. The <b class="emphasis.bold">range</B
> parameter must be associated with
a <b class="emphasis.bold">subnet</B
> statement. All addresses in the scope of the <b class="emphasis.bold">range</B
>
parameter must be in the subnet in which the <b class="emphasis.bold">range</B
> parameter is
declared. The <em class="emphasis">dynamic-bootp</EM
> flag<a class="indexterm" name="AUTOID-25436"></A
>
is specified if addresses may be
automatically assigned to BOOTP clients as well as DHCP clients. The
<b class="emphasis.bold">range</B
> parameter
must be defined if you intend to use dynamic address assignment. If the
<b class="emphasis.bold">subnet</B
> statement does not include a <b class="emphasis.bold">range</B
> parameter, dynamic address
assignments are not made to clients on the subnet.</P
></DD
><dt class="term"><b class="emphasis.bold">default-lease-time</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The life of an address lease in seconds that is used if the client does
not request a specific lease length.</P
></DD
><dt class="term"><b class="emphasis.bold">max-lease-time</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The maximum life of an address lease in seconds regardless of the lease
length the client requests.</P
></DD
><dt class="term"><b class="emphasis.bold">hardware</B
> <code class="replaceable"><i>type</I
></CODE
> <code class="replaceable"><i>address</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines a client's hardware address. At present, <code class="replaceable"><i>type</I
></CODE
> must be
either <code class="literal">ethernet</CODE
> or <code class="literal">token-ring</CODE
>. <code class="replaceable"><i>address</I
></CODE
> must be
an appropriate physical address for the type of hardware. The hardware
parameter must be associated with a host statement. It is required for
a BOOTP client to be recognized. It is optional for DHCP clients for
which it is an alternative to the <b class="emphasis.bold">dhcp-client-identifier</B
> option.</P
></DD
><dt class="term"><b class="emphasis.bold">filename</B
> <code class="replaceable"><i>file</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Identifies the boot file for diskless clients. <code class="replaceable"><i>file</I
></CODE
> is an ASCII
string enclosed in quotation marks.</P
></DD
><dt class="term"><b class="emphasis.bold">server-name</B
> <code class="replaceable"><i>name</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The hostname of the DHCP server that is provided to the client. <code class="replaceable"><i>name</I
></CODE
>
is an ASCII string enclosed in quotation marks.</P
></DD
><dt class="term"><b class="emphasis.bold">next-server</B
> <code class="replaceable"><i>name</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The hostname or address of the server from which the boot file is to
be loaded.</P
></DD
><dt class="term"><b class="emphasis.bold">fixed-address</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>... ]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Assigns one or more fixed IP addresses to a host. The <b class="emphasis.bold">fixed-address</B
>
parameter is valid only when associated with a host statement. If more
than one address is supplied, the client is assigned the address that is
valid for the subnet on which it is booting. If none of the addresses
is valid for the subnet, no configuration data is sent to the client.</P
></DD
><dt class="term"><b class="emphasis.bold">dynamic-bootp-lease-cutoff</B
> <code class="replaceable"><i>date</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Sets a termination date for addresses assigned to BOOTP clients.<a class="indexterm" name="AUTOID-25508"></A
>
BOOTP clients do not have a way of renewing leases and don't know that
address leases expire. By default, <b class="emphasis.bold">dhcpd</B
> assigns permanent address
to BOOTP clients. This parameter changes that behavior. It is used
only in special circumstances where the life of all systems is known
in advance&nbsp;- for example, on a college campus where it is known that all
student systems will be removed by June.</P
></DD
><dt class="term"><b class="emphasis.bold">dynamic-bootp-lease-length</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the life of an address lease in seconds for an address
automatically assigned to a BOOTP client. As noted above, BOOTP clients
do not understand address leases. This parameter is used only in special
circumstances where clients use a BOOTP boot PROM and run an operating
system that supports DHCP. During the boot the client acts as a BOOTP
client, but once it boots the client runs DHCP and knows how to renew
a lease. Use this parameter, and the previous one, with caution.&#13;</P
></DD
><dt class="term"><b class="emphasis.bold">boot-unknown-clients</B
> <code class="replaceable"><i>flag</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Tells <b class="emphasis.bold">dhcpd</B
> whether or not to dynamically assign addresses to
unknown clients. If <code class="replaceable"><i>flag</I
></CODE
> is &quot;false,&quot; addresses are provided
only to clients that have a host statement in the configuration file.
By default, the flag is &quot;true&quot; and addresses are dynamically assigned
to any client on a valid subnet.&#13;</P
></DD
><dt class="term"><b class="emphasis.bold">get-lease-hostnames</B
> <code class="replaceable"><i>flag</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Tells <b class="emphasis.bold">dhcpd</B
> if it should send a DNS hostname to the client when
it dynamically assigns it an IP address. If <code class="replaceable"><i>flag</I
></CODE
> is &quot;true,&quot;
<b class="emphasis.bold">dhcpd</B
> uses DNS to look up the hostnames for all dynamically
assigned addresses, which dramatically slows DHCP performance. By
default the <code class="replaceable"><i>flag</I
></CODE
> is &quot;false&quot; and no lookups are done.&#13;</P
></DD
><dt class="term"><b class="emphasis.bold">use-host-decl-names</B
> <code class="replaceable"><i>flag</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Causes the name provided on the host statement to be supplied to the
client as its hostname.<a class="indexterm" name="AUTOID-25546"></A
></P
></DD
></DL
></DIV
><div class="sect2"><h3 class="sect2"><a class="title" name="TCP2-AP-4-SECT-3.3">D.3.3 DHCP Options</A
></H3
><p class="para"><a class="indexterm" name="TCP2-AP-4-IX-DYNAMIC-HOST-CONFIGURATION-PROTOCOL-DHCP-OPTIONS-AVAILABLE-WITH"></A
>The option statements available with <b class="emphasis.bold">dhcpd</B
> cover all of the standard
DHCP configuration options currently defined in the RFCs. Furthermore the
syntax of the <em class="emphasis">dhcpd.conf</EM
> option statement is extensible. A new
option can be identified by its decimal option code. All options are
assigned a decimal option code, either in the RFC that describes the
option or in the vendor documentation if it is vendor-specific. The value
assigned to the new option can be expressed as a string enclosed in quotes
or as a colon-separated list of hexadecimal numbers. Imagine that a new
DHCP option is created and assigned an option code of 133. Further,
imagine that the value carried by this option is a 16-bit binary mask
and that you want your clients to &quot;turn on&quot; the high-order 4-bit and
&quot;turn off&quot; all other bits in the mask. You could add the following
option to your configuration:</P
><p class="para"><blockquote class="screen"><pre class="screen">option option-133 F0:00</PRE
></BLOCKQUOTE
></P
><p class="para">&#13;All option statements begin with the keyword <code class="literal">option</CODE
>. The keyword
is then followed by the name of the option and the value assigned to
the option, in that order. In the example above, the option name is in
the form <b class="emphasis.bold">option-</B
><code class="replaceable"><i>nnn</I
></CODE
>, where <code class="replaceable"><i>nnn</I
></CODE
> is the decimal option code
assigned to the option. In this manner any new option that appears can
be added to <em class="emphasis">dhcpd.conf</EM
> file. The value assigned to this imaginary
option is F000.</P
><p class="para">Looking at the huge list of standard options, you may well wonder if
they will ever need to be extended. The standard options are listed in
the following section. The types of values that are assigned to options
are:</P
><dl class="variablelist"><dt class="term"><em class="emphasis">Address</EM
></DT
><dd class="listitem"><p class="para">An IP address written in dotted decimal notation or a host
name that resolves to an address</P
></DD
><dt class="term"><em class="emphasis">String</EM
></DT
><dd class="listitem"><p class="para">A series of characters enclosed in quotation marks</P
></DD
><dt class="term"><em class="emphasis">Number</EM
></DT
><dd class="listitem"><p class="para">A numeric value</P
></DD
><dt class="term"><em class="emphasis">Flag</EM
></DT
><dd class="listitem"><p class="para">A switch containing either 1 or 0</P
></DD
></DL
><p class="para">In this book, the list of options is divided into &quot;Commonly used
options&quot; and &quot;Other options.&quot;</P
><div class="sect3"><h4 class="sect3"><a class="title" name="TCP2-AP-4-SECT-3.3.1">D.3.3.1 Commonly used options</A
></H4
><p class="para"><a class="indexterm" name="TCP2-AP-4-IX-DYNAMIC-HOST-CONFIGURATION-PROTOCOL-DHCP-OPTIONS-AVAILABLE-WITH-COMMONLY-USED"></A
></P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">option subnet-mask</B
> <code class="replaceable"><i>mask</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Specifies the subnet mask in dotted decimal notation. If the subnet
mask option is not provided, <b class="emphasis.bold">dhcpd</B
> uses the network mask from the
<b class="emphasis.bold">subnet</B
> statement.</P
></DD
><dt class="term"><b class="emphasis.bold">option time-offset</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Specifies the number of seconds this time zone is offset from Coordinated
Universal Time (ETC).</P
></DD
><dt class="term"><b class="emphasis.bold">option routers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the routers the client should use, in order of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option domain-name-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the Domain Name System (DNS) name servers the client should use,
in order of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option lpr-servers</B
> <code class="replaceable"><i>address </I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists line printer (LPR) servers the client should use, in order of
preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option host-name</B
> <code class="replaceable"><i>host</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the hostname the client should use.</P
></DD
><dt class="term"><b class="emphasis.bold">option domain-name</B
> <code class="replaceable"><i>domain</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the domain name.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">interface-mtu</B
> <code class="replaceable"><i>bytes</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the MTU the client should use. The minimum legal value for
the MTU is 68.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">broadcast-address</B
> <code class="replaceable"><i>address</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the broadcast address for the client's
subnet.</P
></DD
><dt class="term"><b class="emphasis.bold">option static-routes</B
> <code class="replaceable"><i>destination gateway</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>destination gateway</I
></CODE
>... ]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the static routes the client should use. The default route
cannot be specified in this manner. Use the routers option for the
default route.</P
></DD
><dt class="term"><b class="emphasis.bold">option trailer-encapsulation </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should use trailer encapsulation. See the
discussion of trailer encapsulation in <a class="xref" href="ch06_01.htm" title="Configuring the Interface ">Chapter 6, <cite class="chapter">Configuring the Interface </CITE
></A
>. 0 means &quot;no&quot;
the client shouldn't and 1 means &quot;yes&quot; the client should use
trailer encapsulation.</P
></DD
><dt class="term"><b class="emphasis.bold">option nis-domain</B
> <code class="replaceable"><i>string</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">A character string that defines the name of the Network Information Services
(NIS) domain.</P
></DD
><dt class="term"><b class="emphasis.bold">option nis-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists IP addresses of the NIS servers the client should use, in order
of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option dhcp-client-identifier</B
> <code class="replaceable"><i>string</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Used in the host statement to define the DHCP client identifier.
<b class="emphasis.bold">dhcpd</B
> can use the client identifier to identify DHCP clients in
lieu of the hardware address.<a class="indexterm" name="AUTOID-25708"></A
></P
></DD
></DL
></DIV
><div class="sect3"><h4 class="sect3"><a class="title" name="TCP2-AP-4-SECT-3.3.2">D.3.3.2 Other options</A
></H4
><p class="para"><a class="indexterm" name="TCP2-AP-4-IX-DYNAMIC-HOST-CONFIGURATION-PROTOCOL-DHCP-OPTIONS-AVAILABLE-WITH-OTHERS"></A
></P
><dl class="variablelist"><dt class="term"><b class="emphasis.bold">option time-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the time servers the client should use, in order of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option ien116-name-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...];</DT
><dd class="listitem"><p class="para">Lists the IEN 116 name servers the client should use, in order of
preference. IEN 116 is an obsolete name service. Avoid this and use DNS.</P
></DD
><dt class="term"><b class="emphasis.bold">option log-servers </B
><code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">, </B
><code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the MIT-LCS UDP log servers the client should use, in order of
preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option cookie-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the cookie servers available to the client, in order of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option impress-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the Image Impress servers available to the client, in order of
preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option resource-location-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the Resource Location servers the client should use, in order
of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option boot-size</B
> <code class="replaceable"><i>blocks</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The number of 512-octet blocks in boot file.</P
></DD
><dt class="term"><b class="emphasis.bold">option merit-dump</B
> <code class="replaceable"><i>path</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para"><code class="replaceable"><i>path</I
></CODE
> is a character string that identifies the location of the
file the client should dump core to in the event of a crash.</P
></DD
><dt class="term"><b class="emphasis.bold">option swap-server</B
> <code class="replaceable"><i>address</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Specifies the IP address of the client's swap server.</P
></DD
><dt class="term"><b class="emphasis.bold">option root-path</B
> <code class="replaceable"><i>path</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para"><code class="replaceable"><i>path</I
></CODE
> is a character string that identifies the location of the
client's root disk.</P
></DD
><dt class="term"><b class="emphasis.bold">option ip-forwarding </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should do IP forwarding. 0 disables IP
forwarding, and 1 enables it.</P
></DD
><dt class="term"><b class="emphasis.bold">option non-local-source-routing </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should allow non-local source routes. Source
routes are a potential security problem as they can be used by intruders
to route data off the local network in ways not intended by the local
network administrator. 0 disables forwarding of non-local source
routed datagrams, and 1 enables forwarding. 0 is the more
secure setting.</P
></DD
><dt class="term"><b class="emphasis.bold">option policy-filter</B
> <code class="replaceable"><i>address mask</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address mask</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the IP addresses and masks that specify the only valid
destination/mask pairs for incoming source routes.
Any source-routed datagram whose next-hop address does not match one
of the filters is discarded by the client.</P
></DD
><dt class="term"><b class="emphasis.bold">option max-dgram-reassembly</B
> <code class="replaceable"><i>bytes</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines, in bytes, the largest datagram the client should be
prepared to reassemble. The value of <code class="replaceable"><i>bytes</I
></CODE
> cannot be less than 576.</P
></DD
><dt class="term"><b class="emphasis.bold">option default-ip-ttl</B
> <code class="replaceable"><i>ttl</I
></CODE
> ;</DT
><dd class="listitem"><p class="para">Defines the default time-to-live (ttl) for outgoing datagrams. See the
discussion of <b class="emphasis.bold">traceroute</B
> in <a class="xref" href="ch11_01.htm" title="Troubleshooting TCP/IP ">Chapter 11, <cite class="chapter">Troubleshooting TCP/IP </CITE
></A
>, for information about ttl.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">path-mtu-aging-timeout</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Set the number of seconds for timing out Path MTU values discovered by
the mechanism defined in RFC 1191.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">path-mtu-plateau-table</B
> <code class="replaceable"><i>bytes</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>bytes</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines a table of MTU sizes to use when performing Path MTU Discovery
as defined in RFC 1191. The minimum MTU value cannot be smaller than 68.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">all-subnets-local </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Tells the client if all subnets of the local network use the same MTU.
1 means that all subnets share the same MTU. 0 means that
some subnets have smaller MTUs.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">perform-mask-discovery </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should use ICMP to discover the subnet mask.
0 enables ICMP mask discovery, and 1 disables it. Because the
DHCP server can provide the correct subnet mask, ICMP mask discovery is
rarely used on networks that have a DHCP server.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">mask-supplier </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should respond to ICMP subnet mask requests.
0 means &quot;no&quot; and 1 means &quot;yes&quot; it should respond.</P
></DD
><dt class="term"><b class="emphasis.bold">option </B
><b class="emphasis.bold">router-discovery </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should use the Router Discovery mechanism
defined in RFC 1256 to locate routers. 0 means &quot;no&quot; it shouldn't,
and 1 means &quot;yes&quot; the client should perform router discovery.
Because the DHCP server provides the correct list of routers, router
discovery is rarely used on networks that have a DHCP server.</P
></DD
><dt class="term"><b class="emphasis.bold">option router-solicitation-address</B
> <code class="replaceable"><i>address</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the address to which the client should transmit a router
solicitation request if router discovery is enabled.</P
></DD
><dt class="term"><b class="emphasis.bold">option arp-cache-timeout</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the number of seconds entries are maintained in the ARP cache.</P
></DD
><dt class="term"><b class="emphasis.bold">option ieee802-3-encapsulation </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should use Ethernet II (DIX) or IEEE 802.3
Ethernet encapsulation on the network. 0 tells the client to use
Ethernet II and 1 tells the client to use IEEE 802.3 encapsulation.</P
></DD
><dt class="term"><b class="emphasis.bold">option default-tcp-ttl</B
> <code class="replaceable"><i>ttl</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the default TTL for TCP segments. Possible values are 1 to 255.</P
></DD
><dt class="term"><b class="emphasis.bold">option tcp-keepalive-interval</B
> <code class="replaceable"><i>seconds</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">The number of seconds TCP should wait before sending a keepalive message.
0 means that TCP should not generate keepalive messages. Keepalive
messages are generally discouraged.</P
></DD
><dt class="term"><b class="emphasis.bold">option tcp-keepalive-garbage </B
><b class="emphasis.bold">0</B
> | <b class="emphasis.bold">1;</B
></DT
><dd class="listitem"><p class="para">Specifies if the client should send TCP keepalive messages with an octet
of garbage for compatibility with older implementations. 0 means
don't send a garbage octet and 1 means send it. Keepalives are
generally discouraged.</P
></DD
><dt class="term"><b class="emphasis.bold">option ntp-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the IP addresses of the Network Time Protocol (NTP) servers the
client should use, in order of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option netbios-name-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the NetBIOS name servers (NBNS) the client should use, in order
of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option netbios-dd-server</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the NetBIOS datagram distribution servers (NBDD) the client should
use, in order of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option netbios-node-type</B
> <code class="replaceable"><i>type</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Defines the NetBIOS node type of the client. A <code class="replaceable"><i>type</I
></CODE
> of 1 is a
NetBIOS B-node; 2 is a P-node; 4 is an M-node; 8 is an H-node.</P
></DD
><dt class="term"><b class="emphasis.bold">option netbios-scope</B
> <code class="replaceable"><i>string</I
></CODE
><b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">A character string that defines the NetBIOS over TCP/IP scope
parameter as specified in RFC 1001/1002.</P
></DD
><dt class="term"><b class="emphasis.bold">option font-servers</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the X Window System Font servers the client should use, in order
of preference.</P
></DD
><dt class="term"><b class="emphasis.bold">option x-display-manager</B
> <code class="replaceable"><i>address</I
></CODE
>[<b class="emphasis.bold">,</B
> <code class="replaceable"><i>address</I
></CODE
>...]<b class="emphasis.bold">;</B
></DT
><dd class="listitem"><p class="para">Lists the systems running the X Window System Display Manager that the
client should use, in order of preference.<a class="indexterm" name="AUTOID-25991"></A
><a class="indexterm" name="AUTOID-25992"></A
><a class="indexterm" name="AUTOID-25993"></A
><a class="indexterm" name="AUTOID-25994"></A
></P
></DD
></DL
></DIV
></DIV
></DIV
><div class="htmlnav"><p></P
><hr align="LEFT" width="515" title="footer"><table width="515" border="0" cellspacing="0" cellpadding="0"><tr><td align="LEFT" valign="TOP" width="172"><a class="SECT1" href="appd_02.htm" title="D.2 The dhcpd Command"><img src="../gifs/txtpreva.gif" alt="Previous: D.2 The dhcpd Command" border="0"></A
></TD
><td align="CENTER" valign="TOP" width="171"><a class="book" href="index.htm" title="TCP/IP Network Administration"><img src="../gifs/txthome.gif" alt="TCP/IP Network Administration" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172"><a class="APPENDIX" href="appe_01.htm" title="E. A sendmail Reference"><img src="../gifs/txtnexta.gif" alt="Next: E. A sendmail Reference" border="0"></A
></TD
></TR
><tr><td align="LEFT" valign="TOP" width="172">D.2 The dhcpd Command</TD
><td align="CENTER" valign="TOP" width="171"><a class="index" href="index/idx_0.htm" title="Book Index"><img src="../gifs/index.gif" alt="Book Index" border="0"></A
></TD
><td align="RIGHT" valign="TOP" width="172">E. A sendmail Reference</TD
></TR
></TABLE
><hr align="LEFT" width="515" title="footer"><p class="nav"><font size="-1">[ <a href="../index.htm" title="The Networking CD Bookshelf">Library Home</A
> | <a href="../dnsbind/index.htm" title="DNS &amp; BIND">DNS &amp; BIND</A
> | <a href="index.htm" title="TCP/IP Network Administration">TCP/IP</A
> | <a href="../sendmail/index.htm" title="sendmail">sendmail</A
> | <a href="../smdref/index.htm" title="sendmail Desktop Reference">sendmail Reference</A
> | <a href="../firewall/index.htm" title="Building Internet Firewalls">Firewalls</A
> | <a href="../puis/index.htm" title="Practical UNIX &amp; Internet Security">Practical Security</A
> ]</FONT
></P
></DIV
></BODY
></HTML
>
